{
  "360 Coatings Llc": "360 Coatings LLC provides advanced coating solutions for various applications including residential, commercial, and industrial uses.",
  "3M Co": "3M Company is an American multinational conglomerate headquartered in Maplewood, Minnesota, known for producing over 60,000 products across industries such as industry, worker safety, and consumer goods.",
  "4Patriots Llc": "4Patriots LLC is a preparedness company that offers emergency products such as solar generators and survival food, championing freedom and self-reliance while supporting USA veterans.",
  "Ab Electrolux": "AB Electrolux (publ) is a leading global appliance company that manufactures and sells household appliances worldwide, with its stock listed on the Stockholm Stock Exchange.",
  "Abbott Lab": "Abbott is an American multinational medical devices and health care company that offers solutions for cardiovascular health, diabetes management, diagnostic testing, nutrition, and more, with headquarters in Abbott Park, Illinois.",
  "AbbVie Inc": "AbbVie Inc. is an American pharmaceutical company headquartered in North Chicago, Illinois, known for its research and development of medicines and therapies, ranked sixth among the largest biomedical companies by revenue.",
  "AbbVie Inc/Ironwood Pharmaceuticals Inc": "Ironwood Pharmaceuticals is a GI-focused healthcare company that co-develops and co-commercializes LINZESS with AbbVie for the treatment of gastrointestinal diseases, and has a collaboration agreement with COUR Pharmaceuticals.",
  "Accenture Ltd": "Accenture plc is a global professional services company headquartered in Dublin, Ireland, that provides IT services and management consulting.",
  "Acellus Academy": "Acellus Academy is a fully accredited online K-12 school that utilizes the Acellus Gold platform and operates as a program of the International Academy of Science, a Kansas City-based non-profit organization.",
  "Acer Inc": "Acer Inc. is a Taiwanese multinational company headquartered in Xizhi District, New Taipei City, Taiwan, that produces computer hardware and electronics including desktop PCs, laptop PCs, tablets, servers, and Chromebooks.",
  "Activision Blizzard Inc": "Activision Blizzard is an American developer and manufacturer of electronic games, formed in 2008 through the merger of Activision and Vivendi Games, with operations across North America, Europe, and Asia.",
  "Adaptive Health Llc": "Adaptive Health is a consumer health platform offering easy-to-understand health solutions and aiming to provide convenient access to its products via an omni-channel strategy.",
  "Adidas AG": "Adidas AG is a German athletic apparel and footwear corporation headquartered in Herzogenaurach, Bavaria, Germany, known for designing, manufacturing, and marketing sports shoes and apparel.",
  "Adoption Exchange Assn": "Adoption Exchange Association is a national non-profit organization founded in 1982 that assists and encourages members nationwide in finding adoptive families for children and youth in foster care.",
  "Adtalem Global Education Inc": "Adtalem Global Education Inc. is a US corporation based in Chicago, Illinois, that operates several for-profit higher education institutions and is a leading healthcare educator.",
  "Alkermes Inc": "Alkermes is a global biopharmaceutical company that focuses on developing innovative medicines for psychiatric and neurological disorders, with an emphasis on improving outcomes for patients, families, and communities affected by serious mental illness, addiction, and cancer.",
  "Allbirds Inc": "Allbirds is an American public benefit company that sells sustainable footwear and apparel made from natural materials, co-founded by Tim Brown and Joey Zwillinger.",
  "Amazon.com Inc": "Amazon.com, Inc., founded in 1994 by Jeff Bezos, is an American multinational technology company that operates as a global online retail platform offering various products and services including e-commerce, cloud computing, and online advertising.",
  "Amer Sports Corp": "Amer Sports is a Finnish multinational sporting equipment company based in Helsinki, Finland, known for iconic sports and outdoor brands including Arc'teryx, Salomon, Wilson, Peak Performance, Atomic, and Armada.",
  "American Academy Of Professional Coders": "The American Academy of Professional Coders (AAPC) is the world's largest training and credentialing organization for the business of healthcare with over 170,000 members worldwide.",
  "American Behavioral Research Institute Llc": "American Behavioral Research Institute, LLC is a research-driven nutraceutical company that develops and markets innovative OTC products.",
  "American Express Co": "American Express is an American bank holding company and multinational financial services corporation that specializes in payment cards.",
  "American Public Education Inc": "American Public Education, Inc. is a provider of online and campus-based postsecondary education with an emphasis on serving military and public service needs.",
  "Amgen Inc": "Amgen Inc., an American multinational biopharmaceutical company headquartered in Thousand Oaks, California, is a leading independent biotechnology firm that discovers, develops, and manufactures human therapeutics to treat serious illnesses.",
  "Amgen Inc/AstraZeneca Plc": "Amgen Inc is a United States-based biotechnology company established in 1980, and AstraZeneca Plc is a British-Swedish multinational pharmaceutical and biotechnology company. Both companies have had multiple collaborations focusing on the development and commercialization of certain drugs, but Amgen ended one such collaboration due to observed adverse effects.",
  "AO Smith Corp": "A. O. Smith Corp is a global leader in manufacturing and marketing of residential and commercial water heaters, boilers, heat pumps, tanks, and water treatment solutions.",
  "Apellis Pharmaceuticals": "Apellis Pharmaceuticals is a global biopharmaceutical company that develops life-changing therapies by pioneering targeted C3 therapies and leveraging courageous science, creativity, and compassion.",
  "Apollo Education Group Inc": "Apollo Education Group, Inc., founded in 1973 by Dr. John Sperling, is a leading provider of higher education programs for working adults and was acquired in February 2016 for $1.14 billion.",
  "Apollo Global Mgt Inc": "Apollo Global Management, Inc. is a global alternative asset manager and a retirement services provider with a focus on investments in credit, private equity, infrastructure, secondaries, and real estate.",
  "Appchi Media Ltd": "Appchi Media Ltd is a Florida-based limited liability company that provides app development services and offers casino-style mobile apps.",
  "Apple Inc": "Apple Inc. is an American multinational technology company headquartered in Cupertino, California, known for designing, manufacturing, and marketing smartphones, personal computers, tablets, wearables, and accessories.",
  "Argenx SE": "Argenx SE is a global immunology company committed to improving lives through the development of therapies for severe autoimmune diseases.",
  "Ariat Intl Inc": "Ariat International, Inc. is a private company founded in 1993 that designs and manufactures innovative performance equestrian footwear, apparel, and accessories.",
  "Arizona State Of": "The State of Arizona provides outstanding service to residents and organizations and is ready to make real progress on issues that matter most.",
  "Artal Group Sa": "Artal Group S.A. is a Luxembourg-based company that provides advanced financial solutions and specialized technical support, with a portfolio value of $2,382,167,917 USD.",
  "Asset Marketing Services Inc": "Asset Marketing Services, LLC (AMS) is a leading direct-to-consumer collector platform focusing on high-end collectibles and bullion.",
  "Astellas Pharma Inc": "Astellas Pharma Inc is a Japanese multinational pharmaceutical company formed in 2005 through the merger of Yamanouchi Pharmaceutical Co., Ltd and Fujisawa Pharmaceutical Co., Ltd, conducting business in approximately 70 countries around the world.",
  "AstraZeneca Plc": "AstraZeneca is a global science-led biopharmaceutical company with its headquarters at the Cambridge Biomedical Campus, focusing on developing new medicines for patients worldwide.",
  "Authentic Brands Group Llc": "Authentic Brands Group LLC is an American brand management company that provides brand development and licensing services across various industries including apparel, athletics, media, entertainment, sport, fashion, beauty, wellness, home, active, and outdoor sectors.",
  "Automated Pet Care Products Inc": "Automated Pet Care Products Inc designs, engineers, manufactures, and markets innovative pet solutions including self-cleaning litter boxes.",
  "Auxbeam Lighting Co Ltd": "Auxbeam Lighting Co Ltd is a privately held corporation that provides LED lighting solutions for vehicles and related accessories, headquartered in Fontana, California.",
  "Auxilium Pharmaceuticals Inc": "Auxilium Pharmaceuticals, Inc., founded in 1999 and specializing in urology and sexual health products, was acquired by Endo International in January 2015.",
  "Aventon Bikes": "Aventon Bikes is a private California-based company that manufactures and distributes electric bikes and related products, founded by Jianwei (JW) Zhang in 2012.",
  "Avocado Mattress Llc": "Avocado Mattress LLC provides house ware products including mattresses, toppers, bases, pillows, bedding, and more.",
  "Bacardi Ltd": "Bacardi Limited is the world's largest privately held family-owned spirits company, producing and marketing internationally recognized brands of gin, rum, vodka, whisky, vermouth, tequila, and wines.",
  "Bank Of America Corp": "Bank of America Corporation is a global financial institution serving individuals and businesses worldwide, operating as one of the largest banks in the United States by market capitalization.",
  "Barclays Plc": "Barclays is a British multinational universal bank headquartered in London, offering consumer banking and global corporate and investment services.",
  "Bausch Health Cos Inc": "Bausch Health Companies Inc is a global diversified pharmaceutical company based in Laval, Quebec, Canada, focused on improving people's lives through health care products and with a core focus in eye health, gastrointestinal diseases, and dermatology.",
  "Bayer AG Group": "Bayer AG is a German multinational pharmaceutical and biotechnology company with core competencies in health care and agriculture.",
  "Becton Dickinson & Co": "Becton Dickinson and Company (BD) is a global medical technology company that manufactures and sells medical supplies, devices, laboratory equipment, and serves healthcare institutions, life science researchers, clinical laboratories, industry, and the general public.",
  "BELLEVUE UNIVERSITY": "Bellevue University is a private, nonprofit accredited university founded in 1966 in Bellevue, Nebraska, offering online and on-campus degree programs including Bachelor's, Master's, and PhDs.",
  "Berkshire Hathaway Inc": "Berkshire Hathaway Inc is an American multinational conglomerate holding company headquartered in Omaha, Nebraska, with diverse business operations including insurance, freight rail transportation, and utilities.",
  "BIDEN FOR PRESIDENT INC": "BIDEN FOR PRESIDENT INC is not directly addressed in the provided descriptions; it appears to be related to Joe Biden's presidential campaign but no specific description or ownership information is given.",
  "Bissell Inc": "Bissell Inc., also known as Bissell Homecare, is an American privately owned vacuum cleaner and floor care product manufacturing corporation.",
  "Blackstone Products": "Blackstone Products specializes in griddles and related accessories for outdoor cooking.",
  "Blissy Llc": "Blissy LLC is a company known for its high-quality mulberry silk pillowcases and related products, founded by Vahe Haroutounian and Edgar Babayan to address the underserved market for silk pillowcases.",
  "Block Inc": "Block, Inc. (formerly Square, Inc.), a technology company listed on NYSE as XYZ, develops technology to increase access to the global economy through its brands including Square, Cash App, Afterpay, TIDAL, Bitkey, and Proto.",
  "Bloom Chic": "BloomChic is a digital-first fashion brand focused on providing style, comfort, and choice for women sizes 10-30.",
  "Boehringer Ingelheim Gmbh": "Boehringer Ingelheim is a research-driven pharmaceutical company and one of the world's largest private pharmaceutical companies, headquartered in Ingelheim with a focus on human pharmaceuticals and animal health products.",
  "Boehringer Ingelheim Gmbh/Eli Lilly & Co": "Boehringer Ingelheim is a family-owned pharmaceutical company that has partnered with Eli Lilly & Co. on several diabetes treatment initiatives and other research efforts.",
  "Bold Ltd": "BOLD is a global tech company with award-winning products including AI-powered resume and cover letter builders, job search sites, networking platforms, and career productivity tools, employing over 1,200 people globally.",
  "Bombas Llc": "Bombas is a comfort-focused sock and apparel brand that donates one item for every purchase made, with a mission to help those in need.",
  "Bose Corp": "Bose Corporation is an American manufacturing company established by Amar Bose in 1964 that sells audio equipment and focuses on sound innovation.",
  "Boxine GmbH": "Boxine GmbH develops an audio system for children including toniebox and tonies products.",
  "BP Plc": "BP Plc is a British multinational oil and gas company headquartered in London, England, focusing on delivering sustainable energy solutions while improving people's lives and striving for net zero emissions.",
  "Bradford Exchange Ltd": "The Bradford Exchange Ltd is a world leader in direct marketing, offering limited-edition gifts, collectibles, home décor, and jewelry.",
  "Breitling Ag": "Breitling AG is a Swiss luxury watchmaker founded in 1884 that manufactures chronograph wrist watches and related apparel, with its headquarters in Grenchen, Switzerland.",
  "Bridgestone Corp": "Bridgestone Corporation is a Japanese multinational manufacturing company founded in 1931 by Shojiro Ishibashi, known for producing tires and other rubber products, with major shareholders including Bridgestone Corporation itself and Sompo Holdings, Inc.",
  "Brinker Intl Inc": "Brinker International, Inc., founded in 1975 and headquartered in Dallas, TX, is a leading casual dining restaurant company with operations across 31 countries and two territories, known for brands like Chili's® Grill & Bar and Maggiano's Little Italy.",
  "Bristol-Myers Squibb Co": "Bristol-Myers Squibb is a global biopharmaceutical company focused on discovering, developing, and delivering innovative medicines for serious diseases.",
  "Bristol-Myers Squibb Co/Pfizer Inc": "Bristol-Myers Squibb and Pfizer entered into a worldwide collaboration in 2007 to develop and commercialize apixaban, an oral anticoagulant, combining Bristol-Myers Squibb's strengths in cardiovascular drug development with Pfizer's global scale.",
  "British American Tobacco Plc": "British American Tobacco plc is a British multinational company that manufactures and sells cigarettes, tobacco, and other nicotine products globally.",
  "Brown-Forman Corp": "Brown-Forman Corporation is an American-based family-owned company that manufactures, distills, bottles, imports, exports, markets, and sells various alcoholic beverages, with a portfolio of fine quality beverage alcohol brands.",
  "BRP Inc": "BRP Inc is a Canadian manufacturer and global leader in powersports vehicles and marine products, founded in 2003, with brands including Ski-Doo, Lynx, Sea-Doo, Can-Am, and others.",
  "BRYANT & STRATTON COLLEGE": "Bryant & Stratton College is a private, nonprofit college offering various degrees and diplomas through on-campus locations in New York, Ohio, Virginia, and Wisconsin, as well as an online division.",
  "California State Of": "California State Portal | CA.gov is the official website for the State of California, providing services and resources.",
  "Capital One Financial Corp": "Capital One Financial Corporation is an American bank holding company specializing in credit cards, auto loans, and banking services, with significant institutional shareholders including The Vanguard Group, BlackRock, and Dodge & Cox.",
  "Capri Holdings Ltd": "Capri Holdings Limited is a global fashion luxury group consisting of iconic brands Versace, Jimmy Choo, and Michael Kors.",
  "Carrier Global Corp": "Carrier Global Corporation is a global leader in sustainable healthy buildings, HVAC, commercial and transport refrigeration solutions.",
  "Casio Computer Co Ltd": "Casio Computer Co., Ltd. is a Japanese multinational electronics manufacturing corporation headquartered in Shibuya, Tokyo, Japan, known for producing timepieces, electronic calculators, and other consumer electronics.",
  "Casper Sleep Inc": "Casper Sleep Inc is an e-commerce company that sells a wide range of sleep products such as mattresses, pillows, sheets, and duvets online and in retail locations.",
  "Caterpillar Inc": "Caterpillar Inc., also known as Cat, is an American company that manufactures construction and mining equipment, off-highway diesel and natural gas engines, industrial gas turbines, and other related products.",
  "Central Garden & Pet Co": "Central Garden & Pet is a market leader in pet and garden industries, offering over 65 high-quality brands and has been nurturing happy and healthy homes for over 40 years.",
  "Chanel Sa": "Chanel SA is a private company owned by the Wertheimer family and is a world leader in creating, manufacturing, and distributing luxury fashion products including ready-to-wear, accessories, fragrances, makeup, and skincare.",
  "Charles Tyrwhitt Shirts Ltd": "Charles Tyrwhitt Shirts Limited is a British multi-channel men's clothing retailer specializing in dress shirts, ties, suits, and other formal menswear.",
  "Chevron Corp": "Chevron Corporation is an international energy company that explores for oil and natural gas, manufactures and sells fuels, lubricants, additives, and petrochemicals, and has its headquarters in Houston, Texas.",
  "Church & Dwight Co Inc": "Church & Dwight Co., Inc. is an American consumer goods company based in Ewing, New Jersey, focusing on personal care, household products, and specialty items, with a market value of $4.9 billion.",
  "Citigroup Inc": "Citigroup Inc. is an American multinational investment bank and financial services company based in New York City.",
  "Citizen Watch Co Ltd": "Citizen Watch Co., Ltd is an electronics company primarily known for its watches and offers a range of electronic products, with major shareholders including Nippon Life Insurance Co. and Nichia Corp.",
  "ClassPass": "ClassPass is an American company that operates a subscription platform for fitness, offering access to thousands of top-rated gyms, studios, salons, and spas worldwide.",
  "Clorox Co": "Clorox is an American multinational manufacturer and marketer of consumer and professional products, headquartered in Oakland, California, with a global portfolio including cleaning supplies, disinfectants, and more. As of 2024, it had approximately 8,000 employees worldwide and net sales of US$7.1 billion.",
  "CME Group Inc": "CME Group Inc is a financial services company headquartered in Chicago that operates as the world's leading derivatives marketplace offering a wide range of futures and options products for risk management.",
  "CNH Industrial NV": "CNH Industrial N.V. is an Italian-American multinational corporation with global headquarters in Basildon, United Kingdom, and it operates commercially through its brand portfolio which includes Case IH, New Holland, and others.",
  "CNO Financial Group Inc": "CNO Financial Group, Inc is an American financial services holding company that provides life and health insurance, annuities, financial services, and workforce benefits solutions.",
  "Coastal Community Bank": "Coastal Community Bank is a community bank in Northwest Washington that provides business and personal banking services, with headquarters in Everett, Washington.",
  "Cogswell Education Llc": "Cogswell Education LLC is a private for-profit educational institution based in California that specializes in computer science and game design programs, and it assumed full ownership of DeVry University on December 11, 2018.",
  "Colgate-Palmolive Co": "Colgate-Palmolive is an American multinational consumer products company headquartered in New York City, known for its global range of trusted brands and a focus on improving health and wellness.",
  "Colorado State Of": "The State of Colorado governs a region in the Western United States and offers various government services including employment opportunities and business entity searches.",
  "Compagnie Financiere Richemont Ag": "Compagnie Financière Richemont SA is a Switzerland-based luxury goods holding company that owns prestigious brands recognized for their excellence in jewellery, watches, fashion and accessories.",
  "Compagnie Generale Des Michelin": "Compagnie Générale des Établissements Michelin SCA is a French multinational tyre manufacturing company based in Clermont-Ferrand.",
  "Contact Lens King Inc": "Contact Lens King Inc is an online retailer of contact lenses and related products established in 2004 by Charles L King, with Samir Gad as the current CEO.",
  "Cornell University": "Cornell University is a private Ivy League land-grant research university based in Ithaca, New York, United States, founded in 1865.",
  "Corteva Inc": "Corteva Agriscience™ is a publicly traded global pure-play agriculture company that offers a comprehensive portfolio of products and services to protect crops from weeds, pests, diseases, and other threats.",
  "Cotton Inc": "Cotton Incorporated is a not-for-profit research and marketing company representing U.S. upland cotton, funded by cotton growers through per-bale assessments on producers and importers.",
  "Coursera Inc": "Coursera Inc is an American global online learning platform that offers courses, certificates, and degrees from leading universities and companies.",
  "Cove Smart Llc": "Cove Smart LLC is a company that offers affordable and customizable DIY home security systems with no contracts and $28/month monitoring.",
  "Cracker Barrel Old Country Store Inc": "Cracker Barrel Old Country Store, Inc., established in 1969, is an American chain of restaurant and gift stores known for its Southern country theme, offering home-away-from-home dining and a variety of decorative and functional items.",
  "Credit One Bank NA": "Credit One Bank, NA, headquartered in Las Vegas, Nevada, specializes in credit cards for borrowers with low credit scores and offers a full spectrum of credit card products.",
  "Darden Restaurants Inc": "Darden Restaurants, Inc., headquartered in Orlando, Florida, is a leading full-service restaurant company operating over 2,100 locations across the United States and Canada.",
  "Deckers Outdoor Corp": "Deckers Outdoor Corporation, doing business as Deckers Brands, is a global footwear designer and distributor based in Goleta, California, known for iconic brands such as UGG®, Teva®, AHNU®, HOKA®, and Koolaburra by UGG®.",
  "Deere & Co": "Deere & Company is an American corporation that manufactures and distributes agricultural machinery, heavy equipment, forestry machinery, and related technology and services.",
  "Dell Technologies Inc": "Dell Technologies Inc. is an American multinational technology company headquartered in Round Rock, Texas, founded as a result of the September 2016 merger and focused on providing essential infrastructure for organizations to transform their digital futures.",
  "Deloitte Touche Tohmatsu Ltd": "Deloitte Touche Tohmatsu Limited (DTTL) is a multinational professional services network based in London, England, and it consists of independent member firms providing audit, tax, consulting, risk management, financial advisory services, and solutions.",
  "Democratic Congressional Campaign Committee": "The Democratic Congressional Campaign Committee (DCCC) is the official campaign arm of the Democrats in the House of Representatives, responsible for supporting Democratic House candidates by recruiting them, raising funds, and organizing races.",
  "Democratic Senatorial Campaign Committee": "The Democratic Senatorial Campaign Committee (DSCC) is the official organization of the Democratic Party dedicated to electing Democrats to the U.S. Senate through fundraising and candidate support.",
  "Dennys Corp": "Denny's Corporation is an American full-service restaurant chain operating over 1,700 restaurants worldwide and known for its 24-hour all-day breakfast menu.",
  "Diageo Plc": "Diageo plc is a British multinational alcoholic beverage company with over 200 brands sold in nearly 180 countries and headquartered in London, England.",
  "Dieteren SA": "D'Ieteren Group is a Belgian company engaged in automobile distribution and vehicle glass repair and replacement, aiming to create sustainable mobility solutions.",
  "Dine Brands Global Inc": "Dine Brands Global Inc., founded in 1958 as IHOP and rebranded in 2007, is a publicly traded food and beverage company based in Pasadena, California, that owns and franchises Applebee's Grill + Bar and IHOP restaurants globally.",
  "Discount Tire Co/Americas Tire Co": "Discount Tire and America's Tire are American tire and wheel retailers with over 1,000 locations across 37 states, founded in 1960 by Bruce T. Halle, and now the largest independent retailer of tires and wheels.",
  "Discover Financial Services": "Discover Financial Services is an American financial services company that owns and operates Discover Bank, providing digital banking products and payment services.",
  "Dolce & Gabbana Srl": "Dolce & Gabbana Srl is an Italian luxury fashion house founded in 1985 by Domenico Dolce and Stefano Gabbana, designing and distributing apparel products including clothing, leather goods, footwear, and fragrances.",
  "DoorDash Inc": "DoorDash is an American technology company that connects consumers with their favorite local businesses for food delivery services across more than 25 countries, trading under the symbol DASH on NASDAQ.",
  "Doosan Corp": "Doosan Corporation is a global diversified company headquartered in Seoul, South Korea, known for its expertise in heavy equipment manufacturing and energy solutions.",
  "DraftKings": "DraftKings Inc. is an American gambling company based in Boston, Massachusetts, offering sportsbook and daily fantasy sports services.",
  "Drink LMNT Inc": "Drink LMNT Inc manufactures and sells a zero-sugar electrolyte drink mix designed for paleo-keto friendly hydration.",
  "Duchossois Industries Inc": "Duchossois Industries Inc was a company that made railcars in large quantities in the 1970s but reduced production in the 1980s.",
  "DudeProducts": "Dude Products is a privately held company based in Chicago, known for its flushable wipes and launched on Shark Tank.",
  "DYSON INC": "Dyson Inc manufactures vacuum cleaners and accessories and is headquartered at 1330 West Fulton Street, 5th Floor, Chicago, IL 60607.",
  "E Mishan & Sons Inc": "E. Mishan & Sons, Inc., is a family owned business with over 70 years experience and ingenuity in branding products with mass appeal.",
  "Echostar Corp": "Echostar Corporation (Nasdaq: SATS) is a global provider of satellite communication solutions and technology, networking services, television entertainment, and connectivity.",
  "Ecoclean Solutions Inc": "EcoClean Solutions Inc provides cleaning services, solid waste collection, and landscaping services in Monrovia, Liberia.",
  "EcoFlow Technology Ltd": "EcoFlow Technology Ltd develops, manufactures, and distributes energy storage batteries, including portable home batteries and outdoors batteries.",
  "Education Principle Foundation": "Education Principle Foundation is a non-profit organization based in New York, NY, with trustees including Robin Van Bokhorst, John J Dagostino, and Andrew Florin, that fosters a philanthropic community to support teaching and learning.",
  "Ego Power Plus": "EGO Power+ is a brand of cordless outdoor power tools known for its patented battery technology that delivers gas-like performance with longer run times and no noise or fumes.",
  "Elanco Animal Health Inc": "Elanco is a global leader in animal health that develops products and services to prevent and treat disease in farm animals and pets.",
  "Electronic Arts Inc": "Electronic Arts Inc. is an American video game company that develops and publishes games for consoles, PCs, and mobile devices, focusing on inspiring the world through play.",
  "Elf Cosmetics Inc": "e.l.f. Beauty, Inc., founded by Joseph Shamah and Scott Vincent Borba in 2004, is an American cosmetics brand based in Oakland, California, known for its affordable, vegan, cruelty-free, and high-quality makeup and skincare products.",
  "Eli Lilly & Co": "Eli Lilly and Company is an American multinational pharmaceutical company headquartered in Indianapolis, Indiana, focused on creating medicines that improve people's lives through scientific innovation.",
  "Endo Intl Plc": "Endo International plc is an American-Irish generics and specialty branded pharmaceutical company that provides life-enhancing healthcare solutions.",
  "Energizer Holdings Inc": "Energizer Holdings, Inc., headquartered in Clayton, Missouri, is one of the world's largest manufacturers of primary batteries and portable lighting products.",
  "EPiServer AB": "EPiServer AB is a privately-held Swedish software company that develops web experience management and digital marketing solutions based on Microsoft technology.",
  "EssilorLuxottica SA": "EssilorLuxottica SA is a Franco-Italian vertically integrated multinational holding company registered in Charenton-Le-Pont and headquartered nearby, known for designing, manufacturing, and distributing ophthalmic lenses, frames, and sunglasses.",
  "Estee Lauder Cos Inc": "The Estée Lauder Companies Inc. is a world-leading manufacturer and marketer of skin care, makeup, fragrance, and hair care products, operating as an American multinational cosmetics company.",
  "EW Scripps Co": "The E.W. Scripps Company is a diversified media company focused on creating a better-informed world through local TV broadcasting and quality journalism.",
  "Exxon Mobil Corp": "Exxon Mobil Corporation is one of the world's largest publicly traded energy providers and chemical manufacturers, managing an industry-leading portfolio of resources and operating as a major US-based oil and gas company.",
  "Eyemart Express": "Eyemart Express is a retail chain of optical stores offering affordable quality eyewear and same-day service, with locations across various states.",
  "EZContacts.com": "EZContacts.com is an online eyewear retailer offering prescription glasses, sunglasses, and contact lenses with free shipping on orders over $99 for U.S. customers.",
  "Farmers Dog Inc": "The Farmer's Dog is a pet food company that offers fresh, human-grade dog food delivered through personalized plans and subscription services.",
  "FedEx Corp": "FedEx Corporation is an American multinational conglomerate specializing in transportation, e-commerce, and business services with a global network for logistics and supply chain management.",
  "Figs Inc": "FIGS, Inc. is a founder-led, direct-to-consumer healthcare apparel and lifestyle brand that sells scrubs and other products for healthcare professionals.",
  "Fila Korea Ltd": "Fila Korea Ltd is a South Korean-owned subsidiary that holds worldwide rights to the Fila footwear and clothing brands.",
  "Fiserv Inc": "Fiserv, Inc. is an American multinational technology company headquartered in Milwaukee, Wisconsin, providing financial technology and services globally.",
  "Flex Seal": "Flex Seal is an American brand of adhesive bonding products owned by the family-owned company Swift Response in Weston, Florida.",
  "Flutter Entertainment Plc": "Flutter Entertainment plc is an Irish-American multinational sports betting and gambling company with a market leading position in the US and across the world, operating through brands like FanDuel, Sky Betting & Gaming, and PokerStars.",
  "Ford Motor Co": "Ford Motor Company is an American multinational automobile manufacturer headquartered in Dearborn, Michigan, with key shareholders including The Vanguard Group, BlackRock, and State Street Corporation.",
  "Fortune Brands Home & Security Inc": "Fortune Brands Home & Security, Inc., headquartered in Deerfield, Illinois, is an industry-leading innovation company that focuses on creating smarter, safer and more beautiful homes and improving lives.",
  "Fossil Inc": "Fossil Group, Inc., founded in 1984 by Tom Kartsotis and headquartered in Richardson, Texas, is a global designer, marketer, and distributor of consumer fashion accessories including watches, handbags, jewelry, and small leather goods.",
  "FRESHPET CO": "Freshpet is an American pet food company that produces refrigerated, all-natural dog and cat food products made with fresh ingredients, requiring storage in the refrigerator.",
  "Full Sail Intl": "Full Sail University offers campus and online degree programs for entertainment media and emerging technologies, with locations in Winter Park, Florida.",
  "Galderma SA": "Galderma SA is a Swiss pharmaceutical company specializing in dermatological treatments and skin care products, operating as a wholly owned subsidiary of Nestlé since 2014.",
  "Gap Inc": "Gap Inc., a house of iconic brands, is the largest specialty apparel company in America with notable brands such as Old Navy, Gap, and Banana Republic.",
  "Gemini": "Gemini is an AI assistant developed by Google, offering various services including writing assistance, code management, and research analysis.",
  "Generac Holdings Inc": "Generac Holdings Inc., commonly known as Generac, is a leading energy technology solutions company that designs, manufactures, and distributes power generation products for residential and commercial use.",
  "General Mills Inc": "General Mills, Inc. is an American multinational manufacturer and marketer of branded processed consumer foods sold through retail stores.",
  "General Motors Corp": "General Motors Company is an American multinational automotive manufacturing company headquartered in Detroit, Michigan, with a rich history and numerous subsidiaries including Buick, Cadillac, GMC, and Chevrolet.",
  "Genuine Parts Co": "Genuine Parts Company is a leading global service provider of automotive and industrial replacement parts and value-added solutions, established in 1928.",
  "Georgetown University": "Georgetown University is a private Jesuit research university founded in 1789, located in Washington D.C., offering a wide range of undergraduate and graduate programs with a focus on social justice and intellectual rigor.",
  "G-III Apparel Group Ltd": "G-III Apparel Group is an American clothing company that designs, manufactures, markets, and sells women's and men's apparel globally through a portfolio of over 30 licensed and owned brands including Calvin Klein and Tommy Hilfiger.",
  "Gilead Sciences": "Gilead Sciences is an American biopharmaceutical company focused on researching and developing treatments for diseases such as HIV and liver disease.",
  "Giorgio Armani Spa": "Giorgio Armani S.p.A., commonly known as Armani, is an Italian luxury fashion house that designs and manufactures clothing, accessories, cosmetics, and home furnishings.",
  "GlassesUSA.com": "GlassesUSA.com is an online retailer offering a wide selection of eyeglasses, sunglasses, and contacts from top designer brands at discounted prices with free shipping, warranties, and multiple payment options.",
  "Glaxosmithkline Plc": "Glaxosmithkline Plc is a British multinational pharmaceutical and biotechnology company headquartered in London with a focus on science, technology, and talent to get ahead of disease.",
  "Goldman Sachs Group Inc": "Goldman Sachs Group, Inc is a leading global investment banking, securities, and asset management firm that provides a wide range of financial services.",
  "GOLO Inc": "GOLO Inc provides software solutions and offers a comprehensive weight loss program aimed at helping individuals improve their metabolic health and achieve sustainable weight loss.",
  "Goodyear Tire & Rubber Co": "Goodyear Tire & Rubber Company is an American multinational tire manufacturer headquartered in Akron, Ohio, with a history dating back over 125 years and employing about 72,000 people across 57 facilities worldwide.",
  "Gorilla Glue Co": "The Gorilla Glue Company is a family-owned manufacturer based in Cincinnati, Ohio, known for their strong glues, tapes, and sealants including the original Gorilla Glue.",
  "Gotham Steel": "Gotham Steel is a manufacturer of durable, non-toxic, ceramic cookware designed for health-conscious cooking, with products including pots, pans, and bakeware made from aluminum and coated with ceramic and titanium.",
  "Grand Canyon University": "Grand Canyon University is a private for-profit Christian university located in Phoenix, Arizona, offering over 200 areas of study through campus and online programs.",
  "Great Healthworks Inc": "Great HealthWorks is a vertically integrated direct-to-consumer company based in Fort Lauderdale, Florida, specializing in health and wellness products such as supplements, founded by Ken Meares.",
  "Guess Inc": "Guess Inc is an American clothing company that designs, markets, distributes, and licenses lifestyle collections for women, men, and children.",
  "Guillemot Intl": "Guillemot International Inc is a designer and manufacturer of interactive entertainment hardware and accessories, with additional activities including fabric supply and manufacturing fire/flame retardant knitting.",
  "Guthy-Renker Corp": "Guthy-Renker is a large and respected direct marketing company based in California that sells health and beauty products directly to consumers through various media channels.",
  "Haier Group Co": "Haier Group is a Chinese multinational home appliances and consumer electronics company headquartered in Qingdao, Shandong, founded in 1984, offering better life solutions through IoT ecosystems and smart home technologies.",
  "Hanesbrands Inc": "Hanesbrands Inc. is an American multinational clothing company based in Winston-Salem, North Carolina, known for manufacturing basics and innerwear brands such as Hanes that offer comfort, quality, and value.",
  "Hankook & Co Ltd": "Hankook & Company is a South Korean conglomerate that primarily focuses on tire manufacturing and other technology sectors, with a history dating back to 1944.",
  "Harley-Davidson Motor Co": "Harley-Davidson Motor Company is a consumer-led motorcycle manufacturer that produces a wide variety of motorcycles, accessories, and apparel, founded in 1903 and currently owned by investors led by Willie Davidson's grandson, Jochen Zeitz.",
  "Harris For President": "Kamala Harris announced her 2024 campaign for president after serving as the 49th vice president of the United States under President Joe Biden from 2021 to 2025.",
  "Harvard University": "Harvard University is a private Ivy League research university founded in 1636 and located in Cambridge, Massachusetts, United States. It does not have owners or issue shares.",
  "Hasbro Inc": "Hasbro is an American multinational toy and game company founded in 1923 by Henry, Hillel, and Herman Hassenfeld, known for providing entertainment through toys and games to children and families worldwide.",
  "Henkel Kgaa": "Henkel AG & Co. KGaA is a German multinational chemical and consumer goods company headquartered in Düsseldorf, Germany, with leading positions in adhesives, sealants, functional coatings, hair care products, laundry detergents, and other consumer brands.",
  "Hermes Intl": "Hermès International S.A., established in 1837, is a French luxury fashion house that specializes in leather goods, silk goods, and lifestyle accessories, with the Hermès family owning a significant portion of the company.",
  "Herzing Educational System": "Herzing Educational System is a private institution that offers career-focused education through Herzing University and Herzing College with campuses across the United States and Canada.",
  "HomeSecuritySystems.net": "HomeSecuritySystems.net is a free online resource that offers valuable content and comparison features for home security systems but does not include all available options and receives advertising compensation from listed companies.",
  "HONDA MOTOR CO LTD LOC DLR": "HONDA MOTOR CO LTD LOC DLR is a Honda dealership locator.",
  "Hormel Foods Corp": "Hormel Foods Corporation is an American multinational food processing company founded in 1891, based in Austin, Minnesota, with over $12 billion in annual revenue across more than 80 countries and owned by The Hormel Foundation (46.8%) among other shareholders.",
  "Hotel Collection Llc": "Hotel Collection LLC is a luxury fragrance and lifestyle brand inspired by hotel experiences, known for sending the beauty of luxury hotels to homes and businesses.",
  "HP Inc": "HP Inc is an American multinational information technology company headquartered in Palo Alto, California, known for developing personal computers and打印机解决方案。",
  "Hurricane Electric Internet Services": "Hurricane Electric is a global Internet service provider offering IP Transit and network tools including IPv6 tunneling services.",
  "Hyundai Corp": "Hyundai Corporation is Korea's leading general trading house, providing export and import services with a wide variety of products ranging from ocean-going vessels to industrial plants and machinery.",
  "HYUNDAI CORP LOC DLR": "Not sure",
  "IBM Corp": "IBM is a global technology innovator with a focus on AI, automation, and hybrid cloud solutions, operating in over 170 countries and having the largest industrial research organization worldwide.",
  "Ideavillage Pdts Corp": "Ideavillage Products is a privately held next generation consumer products company that creates, markets, manufactures, and sells relevant, modern consumer-focused brands.",
  "Illinois State Of": "Not sure",
  "Imkey Bv": "Imkey B.V., founded in 2012 by Menno Olsthoorn and based in Breda, Netherlands, operates a web application for building online documents such as resumes and is now owned by Talent Inc.",
  "Incyte Corp": "Incyte is a global biopharmaceutical company focused on finding solutions for serious unmet medical needs through discovery, development and commercialization of therapeutics.",
  "Indiana State Of": "Indiana is a US state located at the crossroads of America and known for its nickname 'the Hoosier State'. Its capital is Indianapolis.",
  "Indiana Wesleyan University": "Indiana Wesleyan University is a private evangelical Christian university located in Marion, Indiana, offering a variety of academic programs and options for international students.",
  "Intel Corp": "Intel Corporation is an American multinational technology company headquartered in Santa Clara, California, and incorporated in Delaware, known for designing, manufacturing, and selling computer components and related products with a focus on advancing semiconductor technologies.",
  "Intl Fellowship Of Christians & Jews": "The International Fellowship of Christians and Jews is a philanthropic organization founded in 1983 by Yechiel Eckstein, aimed at promoting Christian-Jewish relations and providing aid to Israel and the Jewish people.",
  "Intra-Cellular Therapies Inc": "Intra-Cellular Therapies Inc. is a biopharmaceutical company focused on developing innovative treatments for neuropsychiatric and neurologic disorders, recently acquired by Johnson & Johnson for $14.6 billion.",
  "Investors Mgt Corp": "Investors Management Corporation (IMC) is a privately held company that strives to be a responsible owner of businesses making positive impacts and operates in various industries including restaurant and food & beverage, healthcare services, active outdoor lifestyle, insurance, engineering, and environmental sectors.",
  "IXL INC": "IXL Learning is a leading educational technology company that provides personalized learning products and services for K-12 students across multiple subjects including math, English, science, social studies, and Spanish.",
  "JAB Holding Co": "JAB Holding Company is a privately held German conglomerate headquartered in Luxembourg, owned by the publicity-shy Reimann family and overseen by its leadership team including Joachim Creus (CEO), Peter Harf (Chairman) and Frank Engelen (CFO).",
  "JM Smucker Co": "The J.M. Smucker Company is an American manufacturer of food and beverage products, including coffee, pet snacks, peanut butter, fruit spreads, and more, headquartered in Orrville, Ohio.",
  "Johns Hopkins University": "Johns Hopkins University is a private research university in Baltimore, Maryland, founded in 1876 and known for its academic divisions and rankings.",
  "Johnson & Johnson": "Johnson & Johnson is an American multinational corporation focused on healthcare with expertise in innovative medicine and medical technologies, headquartered in New Brunswick.",
  "JP Morgan Chase & Co": "JPMorgan Chase & Co is an American multinational financial services firm headquartered in New York City, providing global financial services and retail banking with a history dating back to 1799.",
  "JRSK Inc": "JRSK, Inc., founded in 2015 and based in New York, US, operates under the business name Away and manufactures and sells lifestyle luggage and travel accessories.",
  "Keiser University": "Keiser University is a private, not-for-profit university founded in 1977 with campuses in Florida and an online division, offering career-focused undergraduate and graduate degrees.",
  "Kering SA": "Kering is a French multinational holding company specializing in luxury goods, including fashion, leather goods, jewelry, eyewear, and beauty products.",
  "Kia Corp Local Dealer": "Kia Corp Local Dealer is an authorized Kia showroom and dealer network in Bangalore, India, with multiple locations such as VST Central KIA and Advaith Kia.",
  "Kimberly-Clark Corp": "Kimberly-Clark Corporation is an American multinational consumer goods and personal care corporation that produces mostly paper-based consumer products.",
  "Knix Wear Inc": "Knix Wear Inc is a women's underwear brand that offers products such as wireless bras, period proof underwear, sports bras, and loungewear, acquired by Essity for $320 million in 2022.",
  "Koch Industries Inc": "Koch Industries Inc is an American multinational conglomerate based in Wichita, Kansas, engaged in diverse industries such as petroleum refining, chemicals, biofuels, and ingredients, and is one of the largest privately held companies in America.",
  "Kohler Co": "Kohler Co is one of America's oldest and largest privately held companies known for its plumbing products, furniture, cabinetry, engines, and generators. It hosts world-class hospitality experiences and has been present in India for over 16 years.",
  "KPS Capital Partners LP": "KPS Capital Partners, LP is a global private equity firm with expertise in manufacturing industries and manages KPS Special Situation Funds.",
  "Kraft Heinz Co": "The Kraft Heinz Company is a leading global food and beverage company with a portfolio of iconic brands and one of the largest companies in its industry, valued by major shareholders including Berkshire Hathaway Inc.",
  "Landrys Inc": "Landry's Inc., a privately held American multinational corporation owned by Tilman Fertitta, is a leader in dining, hospitality, entertainment, and gaming with headquarters in Houston, Texas.",
  "La-Z-Boy Inc": "La-Z-Boy Inc is an American furniture manufacturer and retailer founded in 1927, known for producing home furniture including sofas, recliners, and chairs.",
  "Lego Systems A/S": "LEGO System A/S is a Danish toy production company based in Billund, Denmark, and it is owned by KIRKBI A/S (75%) and the LEGO Foundation (25%).",
  "Lenovo Group Ltd": "Lenovo Group Limited is a Chinese multinational technology company with global operations, ranked at #217 in the Fortune Global 500 and employing 77,000 people worldwide.",
  "LENS.COM": "Lens.com is a leading online destination for contact lenses since 1995, offering popular brands at wholesale prices with convenient quick shipping.",
  "Level Home Inc": "Level Home Inc is a startup specializing in home automation and smart home control, headquartered in Redwood City, CA, and acquired by Assa Abloy.",
  "Levi Strauss & Co": "Levi Strauss & Co is an American clothing company known for its denim jeans and founded in May 1853 by German-Jewish immigrants.",
  "LG Group Ltd": "LG Group Ltd is a South Korean multinational conglomerate founded in 1947 by Koo In-hwoi, with diverse business areas including electronics and chemicals, and is managed by figures such as Koo Kwang-mo (chairman) and Kwon Young-soo (vice chairman).",
  "LIBERTY UNIVERSITY": "Liberty University is a private evangelical Christian university in Lynchburg, Virginia, offering over 600 degrees at the bachelor's, master's, or doctoral level both on its campus and online.",
  "Lixil Corp": "LIXIL Corporation is a global leader in housing and building materials, products, and services, known for making pioneering water and housing products that solve everyday challenges to create better homes for everyone.",
  "L'Oreal Sa": "L'Oréal S.A. is a French multinational personal care corporation headquartered in Clichy, Hauts-de-Seine, and is the world's largest developer, manufacturer, and seller of commercial and professional hair, beauty, and health products.",
  "Louisiana State Of": "The official website of Louisiana provides a gateway to services provided by the executive, legislative and judicial branches of the state government.",
  "Lovevery Inc": "Lovevery is a company that provides Montessori-inspired toys and Play Kits for babies and toddlers, designed by child development experts to support stage-based play.",
  "Lululemon Athletica Inc": "Lululemon Athletica Inc., commonly known as lululemon, is a Canadian-American multinational premium athletic apparel retailer that designs and sells technical athletic apparel, footwear, and accessories for various activities including yoga, running, and training.",
  "LVMH Moet Hennessy Louis Vuitton SA": "LVMH Moet Hennessy Louis Vuitton SE is a family-run luxury goods group founded in 1987 through the merger of Louis Vuitton and Moët Hennessy, led by Bernard Arnault.",
  "MacNeil Automotive Products Ltd": "MacNeil Automotive Products Ltd has been providing automotive protection and accessories since 1989, primarily through its WeatherTech brand, which offers interior and exterior protections, floor liners, mats, cargo liners, and other automotive tools and equipment.",
  "Manscaped Llc": "Manscaped LLC is a male grooming company based in San Diego, California, co-founded in 2016 by Steve King and Paul Tran.",
  "Marathon Petroleum Corp": "Marathon Petroleum Corporation is an American petroleum refining, marketing, and transportation company headquartered in Findlay, Ohio.",
  "Mars Inc": "Mars Inc., a family-owned American multinational company, manufactures confectionery, pet food, and other food products, and is dedicated to transforming the world through purpose-driven business practices.",
  "Maryland State Of": "Maryland is a state in the United States with an official government website providing services and information.",
  "MARYVILLE UNIVERSITY": "Maryville University is a private university established in 1872 in St. Louis, Missouri, offering over 90 degree programs across various academic fields.",
  "Masco Corp": "Masco Corporation is a global leader in the design, manufacture and distribution of branded home improvement and building products.",
  "Mastercard Intl Inc": "Mastercard International Inc is an American multinational payment card services corporation that provides a range of financial services and works with businesses and governments worldwide.",
  "Mattel Inc": "Mattel is a leading global toy and family entertainment company known for brands like Barbie, Hot Wheels, and American Girl.",
  "Max Mara Fashion Group Srl": "Max Mara Fashion Group is an Italian fashion house founded in 1951 by Achille Maramotti and owned by his family.",
  "MAZDA MOTOR CORP LOC DLR": "MAZDA MOTOR CORPORATION is a global automaker with dealer locations across countries for selling and servicing its vehicles.",
  "MELFRED BORZALL": "Melfred Borzall is a leading innovator and manufacturer of horizontal directional drilling (HDD) tools with over 70 years of experience.",
  "Merck & Co Inc": "Merck & Co., Inc. is an American multinational pharmaceutical company headquartered in Rahway, New Jersey, founded in 1891 by George Merck, and known for developing important medicines and vaccines.",
  "Meta Platforms Inc": "Meta Platforms Inc is an American multinational technology conglomerate that builds social networking, advertising, and business insight solutions, operates Facebook, Instagram, WhatsApp, and other platforms, and is led by Mark Zuckerberg as Chairman and CEO.",
  "MGM Resorts Intl": "MGM Resorts International is an American multinational hospitality, sports and entertainment company operating resorts globally, including locations in Las Vegas and Massachusetts.",
  "Microsoft Corp": "Microsoft Corporation is an American multinational technology conglomerate headquartered in Redmond, Washington, known for AI, cloud services, productivity tools, computing solutions, gaming, and apps.",
  "Missouri State Of": "The description and ownership information provided does not clearly identify a single company called 'Missouri State Of'. The content is primarily about the state of Missouri and its government services.",
  "Mitsubishi Electric Corp": "Mitsubishi Electric Corporation is a Japanese multinational electronics and electrical equipment manufacturing company headquartered in Tokyo, Japan, known for its leadership in the manufacture and sales of electric and electronic products and systems used in various sectors including energy, industrial machinery, and mobility.",
  "MITSUBISHI MOTORS CORP LOC DLR": "MITSUBISHI MOTORS CORP LOC DLR is a service center locator for finding nearest Mitsubishi dealerships and service centers.",
  "Miyake Design Studio Co Ltd": "Miyake Design Studio Co., Ltd. was founded in 1971 and owns Issey Miyake Inc., providing business services and supervising the creative direction for fragrances.",
  "Mondelez Intl Inc": "Mondelēz International, Inc. is an American multinational company that manufactures and sells snack food and beverage products worldwide.",
  "Monster Worldwide Inc": "Monster Worldwide Inc is a global online employment solutions company based in New York that provides job search, career advice, and hiring resources, with recent changes involving the transfer of a controlling interest to CareerBuilder, LLC.",
  "Moose Enterprise P/L": "Moose Enterprise Pty Ltd is an Australian-owned toy design, development, and distribution company founded in 1985.",
  "Movado Group": "Movado Group is a global leader in the watch industry offering a portfolio of ten widely respected brands including Movado, EBEL, Concord, and Olivia Burton.",
  "MyComputerCareer.com Inc": "MyComputerCareer.com, Inc., founded by Tony Galati in 2007, is an IT school offering comprehensive training and certifications with campuses across the U.S.",
  "MyPillow Inc": "MyPillow is an American pillow-manufacturing company based in Chaska, Minnesota, founded in 2009 by Mike Lindell.",
  "National Republican Congressional Committee": "The National Republican Congressional Committee (NRCC) is a political committee dedicated to electing Republicans to the United States House of Representatives.",
  "National Republican Senatorial Committee": "The National Republican Senatorial Committee (NRSC) is the Republican Party's chief committee for electing Republicans to the U.S. Senate.",
  "National University": "National University is a private university headquartered in San Diego, California, founded in 1971 and offers over 190 flexible online bachelor's and graduate degree programs.",
  "National Vision Inc": "National Vision Inc is one of the largest optical retail companies in the United States with over 1,200 stores in 38 states and Puerto Rico.",
  "Navien Inc": "Navien Inc is a leader in high-efficiency hot water and heating solutions, providing advanced condensing technology for residential and commercial use.",
  "Navy Federal Credit Union": "Navy Federal Credit Union is a member-owned, not-for-profit credit union serving military personnel and their families, with over 14 million members and $180 billion in assets.",
  "NEO COM": "Neo is a diverse mentorship community, startup accelerator, and VC fund that helps tech leaders maximize their potential with world-class mentorship and support from Microsoft and OpenAI.",
  "Nestle Sa": "Nestlé S.A. is a Swiss multinational food and drink processing company headquartered in Vevey, Switzerland.",
  "Neurocrine Biosciences Inc": "Neurocrine Biosciences, Inc., an American biopharmaceutical company founded in 1992 and headquartered in San Diego, California, focuses on developing treatments for neurological, neuroendocrine, and neuropsychiatric disorders.",
  "New Balance Inc": "New Balance is an athletic footwear and apparel manufacturer that has been independent since 1906, focusing on quality products for men, women, and kids.",
  "New Era Cap Co": "New Era Cap Co is an international lifestyle brand with a sports heritage dating back over 100 years, headquartered in Buffalo, New York, and owned by its founding family, the Kochs, with several private equity firms holding minority stakes.",
  "New York University": "New York University is a private research university in New York City, founded in 1831 by the New York State Legislature.",
  "Newell Brands Inc": "Newell Brands Inc. is an American consumer goods company with a strong portfolio of well-known brands such as Graco, Coleman, Oster, Rubbermaid, and Sharpie.",
  "NewYork-Presbyterian Healthcare System": "NewYork-Presbyterian Healthcare System is a network of independent, cooperating hospitals and health facilities across New York state.",
  "Nexters Global Ltd": "Nexters Global Ltd is an international game development company headquartered in Limassol, Cyprus, founded in 2010 by Andrey Fadeev and Boris Gertsovskiy.",
  "NIC Industries Inc": "NIC Industries Inc manufactures industry-leading coatings and distributes them in nearly 90 countries around the world.",
  "Nike Inc": "Nike, Inc., founded in 1964 by Phil Knight and Bill Bowerman, is a global leader in athletic footwear, apparel, and sports equipment with a mission to inspire athletes worldwide and a purpose-driven organization focused on innovation and personal connections.",
  "Nintendo Co Ltd": "Nintendo Co., Ltd. is a Japanese multinational video game company headquartered in Kyoto, engaged in developing, publishing, and releasing video games.",
  "Nissan Motor Co Ltd Local Dealer": "Nissan Motor Co., Ltd. is a global automotive company headquartered in Japan with operations including dealerships and networks in various locations.",
  "Nobull": "NOBULL is an athletic brand founded in 2015 by Marcus Wilson and Michael Schaeffer, offering footwear, apparel, and accessories for people who train hard and don't believe in excuses.",
  "Noom Inc": "Noom is a privately held American consumer-led digital health company offering weight loss, fitness, and mental health services through psychology-based programs and apps.",
  "North Carolina State Of": "The State of North Carolina is a government entity that employs over 81,000 people and includes various agencies, branches, and universities.",
  "Northwell Health": "Northwell Health is New York State's largest healthcare provider and private employer, offering compassionate care through research and with over 21 hospitals and 900 outpatient facilities.",
  "Northwestern University": "Northwestern University is a private research university located in Evanston, Illinois, founded in 1851, known for its collaborative environment and strong academic programs including undergraduate and graduate studies.",
  "Not Itemized-Digital Advertising": "Not Itemized-Digital Advertising is focused on digital ad budgets and inefficiencies in digital advertising markets, with a particular emphasis on ad effect measurement and transparency in media rebates.",
  "Not Itemized-Financial Adv": "Financial advisor fees are generally not tax deductible for most individuals and do not qualify for above-the-line deductions unless itemized expenses exceed 2% of adjusted gross income.",
  "NOT ITEMIZED-FOREIGN ADV": "The company provides guidance and resources related to foreign earned income exclusion, foreign tax credit, and other tax-related issues for U.S. expats and individuals working or living abroad.",
  "NOT ITEMIZED-MISC": "Not sure",
  "NOT ITEMIZED-MISC MERCHANDISE": "Not sure",
  "NOT ITEMIZED-RECRUITMENT": "Not sure",
  "Novartis AG": "Novartis AG is a Swiss multinational pharmaceutical corporation focused on innovation and improving people's lives through healthcare solutions.",
  "Novartis AG/Roche Holding Ltd": "Novartis AG is a publicly traded Swiss multinational pharmaceutical corporation based in Basel, Switzerland, and Roche Holding Ltd is a Swiss multinational healthcare company also headquartered in Basel.",
  "Novo Nordisk AS": "Novo Nordisk A/S is a Danish multinational pharmaceutical company headquartered in Bagsværd, controlled by Novo Holdings A/S which holds the majority of its shares and voting rights.",
  "Ollie Pet Inc": "Ollie Pet Inc. manufactures and delivers customized, fresh, human-grade dog food tailored to each dog's nutritional needs.",
  "On AG": "On Holding AG is a Swiss athletic shoe and performance sportswear company that designs and markets sports clothing and running shoes, with key shareholders including Carlos Alberto da Veiga Sicupira, T. Rowe Price Mid Cap Growth Fund, Inc., and AllianceBernstein LP.",
  "Once Upon A Farm Llc": "Once Upon a Farm LLC is an organic baby food and snack company founded by Cassandra Curtis and Ari Raz in 2015, with Jennifer Garner as one of the co-founders.",
  "One Click Internet Ventures Llc": "One Click Internet Ventures, LLC was founded in Indiana in 2005 and was acquired by FGX International in 2018, becoming an online eyewear retailer.",
  "Oofos Llc": "OOFOS LLC is a company that produces recovery footwear and sandals using OOfoam™ technology designed to reduce stress on feet, joints, and back for both men and women.",
  "Oorah Inc": "Oorah Inc is a non-profit Orthodox Jewish outreach organization founded in 1979 by Rabbi Chaim Mintz, providing educational and community programs to Jewish children and families.",
  "OrthoFeet Inc": "Orthofeet Inc manufactures orthopedic footwear and offers therapeutic shoes, diabetic and self-forming sandals, insoles, and socks.",
  "Otsuka Pharmaceutical Co Ltd": "Otsuka Pharmaceutical Co., Ltd is a pharmaceutical company headquartered in Tokyo, Osaka and Naruto, Japan, established in 1964, dedicated to curing disease and protecting everyday health.",
  "Oura Health Oy": "Oura Health Oy is a Finnish health technology company known for the Oura Ring, a smart ring that tracks sleep, fitness, and stress.",
  "Pair Eyewear": "Pair Eyewear is a customizable eyewear brand offering glasses and sunglasses tailored for women with a focus on style and practicality. The company was founded by Nathan Kondamuri and Sophia Edelstein, Stanford University alumni, and partners with FYidoctors and National Vision to provide customizable prescription and non-Rx glasses.",
  "Panasonic Corp": "Panasonic Holdings Corporation is a Japanese multinational electronics company founded in 1918, headquartered in Kadoma, Osaka Prefecture, Japan, offering products and services including home appliances, housing equipment, consumer electronics, and more.",
  "Pandora A/S": "Pandora A/S is a Danish jewelry manufacturer and retailer founded in 1982 by Per Enevoldsen, known for designing, manufacturing, and marketing hand-finished jewelry made from high-quality materials.",
  "Parsons Xtreme Golf": "Parsons Xtreme Golf (PXG) is a global sports equipment manufacturing company founded by Bob Parsons of GoDaddy, known for designing and selling custom fitted golf clubs and equipment.",
  "Particle Aesthetic Science Ltd": "Particle Aesthetic Science Ltd is a company based in Tel Aviv-Yafo, Israel and also has an office in Lakewood, NJ, USA, specializing in men's grooming products including skincare, hair care, and body care.",
  "PayPal Holdings Inc": "PayPal Holdings, Inc. is an American multinational financial technology company operating a digital payments system globally.",
  "Pearson Plc": "Pearson plc is a multinational corporation headquartered in the UK focused on educational publishing and services, with a commitment to sustainable practices and measurable outcomes.",
  "Pella Corp": "Pella Corporation is a privately held window and door manufacturing company headquartered in Pella, Iowa, and has been leading the industry in innovation and design since its founding in 1925 by the Kuyper family.",
  "Peloton Interactive Llc": "Peloton Interactive Inc is an American exercise equipment and media company based in New York City, offering fitness equipment such as stationary bicycles, treads, fitness apparel, and accessories.",
  "Penn State University": "Pennsylvania State University (Penn State) is a public state-related land-grant research university with campuses and facilities throughout Pennsylvania, known for its top-ranked degree programs and extensive research initiatives.",
  "Pepsico Inc": "PepsiCo, Inc., an American multinational food and snack corporation headquartered in Harrison, New York, is a leading global company known for its diverse range of products including snacks and beverages enjoyed by consumers worldwide.",
  "PER SCHOLAS INC": "Per Scholas is an American nonprofit organization based in The Bronx, New York City, founded in 1995 by John Stookey and Lewis Miller, providing tuition-free technology training to unemployed or underemployed adults for tech careers.",
  "Perdoceo Education Corp": "Perdoceo Education Corporation is a public for-profit education company that offers quality postsecondary education primarily online and through campus-based programs to a diverse student population.",
  "Pernod Ricard Sa": "Pernod Ricard is a global wine and spirits company, the world leader in premium international wines and spirits with a portfolio of over 200 brands.",
  "Petroleos De Venezuela Sa": "Petróleos de Venezuela S.A. (PDVSA) is a Venezuelan state-owned oil and gas company that was created through the nationalization of the petroleum industry on January 1, 1976, and is owned by the Bolivarian Republic of Venezuela.",
  "Pfizer Inc": "Pfizer Inc is an American multinational pharmaceutical and biotechnology corporation headquartered at The Spiral in Manhattan, New York City.",
  "Phathom Pharmaceuticals": "Phathom Pharmaceuticals is a late clinical-stage biopharmaceutical company focused on developing and commercializing novel treatments for gastrointestinal (GI) diseases related to acid.",
  "Phillips 66 Co": "Phillips 66 is an American multinational energy company headquartered in Westchase, Houston, Texas, providing energy solutions and focusing on refining, commercial, and marketing operations.",
  "Pilot Corp": "Pilot Company is an American petroleum corporation headquartered in Knoxville, Tennessee, and operates the Pilot Flying J fuel network and travel centers in North America.",
  "Planet Fitness": "Planet Fitness is an American franchisor and operator of fitness centers based in Hampton, New Hampshire, with around 2,400 clubs.",
  "PlayCore Holdings Inc": "PlayCore Holdings Inc is a leading North American designer, manufacturer, and marketer of commercial playgrounds, parks, recreation, and specialty fitness equipment.",
  "Playtika Ltd": "Playtika is an Israeli digital entertainment company that specializes in mobile games and has a portfolio of over 34 million monthly active users.",
  "Poki BV": "Poki B.V. is an online platform that serves as a playground for players and game developers, offering games and full-service support for game developers.",
  "POLITICAL ADV": "POLITICAL ADV is likely a company focused on political advertising and providing transparency for such ads, but the exact nature and ownership of the organization are not clear from the provided descriptions.",
  "POLITICAL ISSUES": "Political Issues is a broad term referring to matters of governance and policy that affect societies and individuals, often involving division among different groups.",
  "POLO/RALPH LAUREN CORP": "Ralph Lauren Corporation is a global leader in the design, marketing and distribution of luxury lifestyle products across five categories.",
  "Post Holdings Inc": "Post Holdings, Inc., an American consumer packaged goods holding company headquartered in St Louis, Missouri, operates through various segments including center-of-the-store and refrigerated food businesses.",
  "POST UNIVERSITY": "Post University is a private for-profit university founded in 1890 in Waterbury, Connecticut, offering both online and on-campus degrees.",
  "Prada Holding BV": "Prada Holding BV is a holding company that operates in the luxury goods industry and owns I Pellettieri d'Italia S.p.A., a leather goods business, as well as other subsidiaries.",
  "Prager University": "PragerU is an American nonprofit advocacy group and media organization that creates short educational videos promoting conservative and capitalist viewpoints.",
  "Princeton Review": "The Princeton Review is an education services company providing tutoring, test preparation, and admission resources for students, founded in 1981. It was acquired by Tutor.com in 2014.",
  "PrizePicks": "PrizePicks is a daily fantasy sports platform that allows users to pick more or less on player stats for up to 25x winnings and offers instant matching of first deposits.",
  "Proximo Spirits Inc": "Proximo Spirits, Inc., is an American multinational alcoholic beverage company based in Jersey City, New Jersey, known for producing and distributing premium spirits.",
  "Purple Innovation Llc": "Purple Innovation, LLC is a technology company that designs and manufactures sleep products such as mattresses, pillows, and other comfort items.",
  "Quince Llc": "Quince is an affordable luxury brand that sells high-quality fashion and home goods at radically low prices—direct from the factory floor.",
  "Quten Research Institute": "Quten Research Institute was founded in 2007 with the mission of creating high-quality CoQ10 supplements and was acquired by Sanofi in July 2023.",
  "Rank Group Ltd": "Rank Group Limited is a privately held investment company based in Auckland, New Zealand, owned by billionaire Graeme Hart.",
  "Rasmussen University": "Rasmussen University is an institutionally accredited private university offering degrees and certificates from associate to doctoral level, with campuses in multiple states including Minnesota, North Dakota, Florida, Wisconsin, Illinois, Kansas, and online, and is a wholly-owned subsidiary of American Public Education, Inc.",
  "Reckitt Benckiser Plc": "Reckitt Benckiser Group Plc is a British multinational consumer goods company headquartered in Slough, United Kingdom, known for its hygiene, health, and nutrition brands.",
  "Recreation Vehicle Industry Assn": "The Recreation Vehicle Industry Association (RVIA) is the national trade association representing over 400 RV manufacturers and their component suppliers.",
  "Recruit Holdings Co Ltd": "Recruit Holdings Co., Ltd is a global technology company based in Tokyo, Japan that provides HR technology and business solutions to simplify the hiring process and help businesses work smarter.",
  "Red Robin Gourmet Burgers Inc": "Red Robin Gourmet Burgers, Inc. is a casual dining restaurant chain founded in 1969 that operates through its wholly-owned subsidiary, Red Robin International.",
  "Regeneron Pharmaceuticals Inc": "Regeneron Pharmaceuticals, Inc. is an American biotechnology company founded in 1988 that invents, develops and commercializes life-transforming medicines for people with serious diseases.",
  "Regeneron Pharmaceuticals Inc/Sanofi": "Regeneron Pharmaceuticals acquired exclusive rights to Libtayo from Sanofi, with Sanofi retaining a stake and ownership details varying over time.",
  "Regent University": "Regent University is a private Christian college founded in 1978 by Pat Robertson, offering a range of undergraduate and graduate programs both on-campus and online.",
  "Resident Home Llc": "Resident Home LLC is a privately-held house of direct-to-consumer mattress and bedding brands founded in 2017 by Craig Reske.",
  "RGO Technologies Llc": "RGO Technologies, LLC is a local Alberta company since 1966, providing services and products from leading brands such as Kyocera, Canon, Epson, HP, specializing in furniture, window coverings, flooring, and technologies.",
  "Roark Capital Group": "Roark Capital Group is an Atlanta-based private equity firm with around $37 billion to $38 billion in assets under management, focusing on leveraged buyout investments and consumer and business service sector investments.",
  "Robert Bosch Gmbh": "Robert Bosch GmbH is a German multinational engineering and technology company that was founded by Robert Bosch and is now 94% owned by the Robert Bosch Stiftung, a charitable institution.",
  "Robert Half Intl Inc": "Robert Half is a global human resource consulting firm that provides staffing and recruitment services in specialized fields such as finance, law, technology, and more.",
  "Roche Holding Ltd": "Roche is a global pioneer in pharmaceuticals and diagnostics focused on advancing science to improve people's lives.",
  "Rocking Inc": "Rocking Inc designs, manufactures, and distributes innovative rocking solutions and accessories perfect for modern, mobile lifestyles.",
  "Roku Inc": "Roku, Inc. is an American technology company founded in 2002 by Anthony Wood that produces streaming players and TVs, distributes streaming services, and operates a TV streaming platform.",
  "Rolex Watch Co SA": "Rolex SA is a Swiss watch brand and manufacturer based in Geneva, founded in 1905 by Hans Wilsdorf, known for crafting high-precision timepieces from fine materials, with operational leadership residing in Geneva.",
  "Roman Health Medical Llc": "Roman Health Medical LLC operates as a telehealth company connecting patients with US-licensed professionals entirely online, offering platforms for men's and women's health, weight loss, sexual health, hair loss, and other health treatments.",
  "Ross-Simons Jewelers": "Ross-Simons is an American jeweler known for offering affordable luxury jewelry with a wide selection of earring collections, necklaces, rings, and more since 1952.",
  "Rove Concepts": "Rove Concepts is a company based in the Pacific Northwest that offers Mid Century and Modern furniture, lighting, accents, and decor, focusing on quality and contemporary design.",
  "Royal Philips Electronics NV": "Royal Philips Electronics NV is a Dutch multinational conglomerate corporation focused on health technology, aiming to improve people's health and well-being through meaningful innovation.",
  "Ruggable Llc": "Ruggable is a Los Angeles-based, venture-backed e-commerce company that manufactures and distributes machine-washable rugs, runners, and doormats.",
  "Rush Street Gaming Llc": "Rush Street Gaming is one of the leading developers and operators of destination casinos in North America, known for its comprehensive gaming properties including slot and table games, restaurants, and hotels.",
  "RWJBarnabas Health": "RWJBarnabas Health is the state's largest and most comprehensive academic health care system in New Jersey, providing high-quality patient care and leading-edge research across a network of healthcare facilities.",
  "S&P Global Inc": "S&P Global Inc. is an American publicly traded corporation headquartered in Manhattan, New York City, providing financial information and analytics primarily in the global capital, commodity, and automotive markets.",
  "Saatva Inc": "Saatva is an American privately held e-commerce company based in New York City that specializes in luxury mattresses and has appeared multiple times on the Inc. 5000 Fastest-Growing Private Companies list.",
  "Safe Step Walk-In Tub Co": "Safe Step Walk-In Tub Co is an American company that designs and manufactures walk-in tubs and showers focused on safety, comfort, and independence for seniors, and was acquired by Ferguson.",
  "Salvatore Ferragamo SpA": "Salvatore Ferragamo SpA is an Italian luxury fashion house focused on apparel, footwear, and accessories, and is the parent company of one of the world's leading luxury groups.",
  "Samsung Group": "Samsung Group is a South Korean multinational manufacturing conglomerate headquartered in Seoul, consisting of several business areas including consumer electronics and IT & mobile communications.",
  "Sanofi": "Sanofi is a French multinational pharmaceutical and healthcare company headquartered in Paris, France, focused on improving lives through medicines and vaccines.",
  "Santoni": "Santoni is an Italian fashion brand of luxury shoes founded in 1975 by Andrea Santoni, known for its handmade and high-quality footwear, with a strong focus on craftsmanship and excellence.",
  "Saudi Arabia Kingdom Of": "The Kingdom of Saudi Arabia is a sovereign Arab Islamic state located in the Middle East, ruled by the House of Saud and has the largest land area in the Arabian Peninsula.",
  "Sazerac Co Inc": "Sazerac Company is a privately held American alcoholic beverage company founded in 1850, known for its over 450 global distillery brands and operations around the world.",
  "SC Johnson & Son Inc": "SC Johnson & Son Inc is a privately held American multinational corporation owned by the Johnson family, focusing on household cleaning supplies and other home products.",
  "Scotts Miracle-Gro Co": "Scotts Miracle-Gro Company is an American multinational corporation headquartered in Marysville, Ohio, known for its innovative lawn and gardening products and a history dating back to 1868.",
  "Seminole Tribe Of FL": "The Seminole Tribe of Florida is a federally recognized Native American tribe and sovereign government located in Florida, dedicated to providing high-quality care and services, with an estimated wealth near US$12 billion as of 2016.",
  "Senior Life Insurance Co": "Senior Life Insurance Company provides affordable final expense products and whole life insurance policies for individuals from birth through age 85, founded by Ron Powell in 2000.",
  "Serta Simmons Holdings Llc": "Serta Simmons Bedding, LLC is one of the leading global sleep companies with a focus on mattresses and related bedding products.",
  "Servant Foundation": "The Servant Foundation, also known as The Signatry, is an American 501(c)(3) non-profit organization primarily funded by anonymous donors and known for launching the 'He Gets Us' ad campaign during the Super Bowl.",
  "Shapermint": "Shapermint is a direct-to-consumer shapewear and intimates brand offering bras, shapewear, underwear, leggings, and more for various body types and sizes at affordable prices.",
  "SharkNinja Operating Llc": "SharkNinja Operating LLC is a global product design and technology company that manufactures electronic products including vacuum cleaners, steam mops, hair care, and air purifiers for home and kitchen use.",
  "Shell Plc": "Shell plc is a British-Dutch multinational oil and gas company headquartered in London, United Kingdom, and The Hague, Netherlands.",
  "Sherwin-Williams Co": "Sherwin-Williams Company is an American paints and coatings company based in Cleveland, Ohio, engaged in the manufacture, distribution, and sale of paints, coatings, floorcoverings, and related products with operations in over 120 countries.",
  "Siemens Ag": "Siemens AG is a German multinational technology conglomerate focused on industry, infrastructure, transport, and healthcare.",
  "SimpliSafe Inc": "SimpliSafe is a home security company headquartered in Boston, Massachusetts that designs and sells wireless, cellular home security systems and monitoring services.",
  "Simply Good Foods Co": "The Simply Good Foods Company is a consumer-packaged food and beverage company focused on developing, marketing, and selling snacks and meals that support a low carb/low sugar lifestyle.",
  "Skechers USA Inc": "Skechers USA, Inc. is a Fortune 500 company based in Southern California that designs, develops, and markets lifestyle and performance footwear for men, women, and children globally.",
  "Skims Body Inc": "Skims Body Inc is an American shapewear and clothing brand co-founded by Kim Kardashian, Emma Grede, and Jens Grede, focusing on body positivity and offering underwear, shapewear, and loungewear.",
  "Sleep Number Corp": "Sleep Number Corporation is an American wellness technology company that designs, manufactures, and markets sleep solutions including beds, bedding accessories, and related products.",
  "Sonnys Real Pit BBQ": "Sonnys Real Pit BBQ is a barbecue restaurant chain founded by Floyd 'Sonny' Tillman in Gainesville, Florida, in 1968, known for slow-smoked meats and operating multiple locations.",
  "Sony Corp": "Sony Corporation is a Japanese multinational conglomerate headquartered in Tokyo, Japan, responsible for the Sony Group's Entertainment, Technology & Services business.",
  "SOUTH COLLEGE": "South College is a private for-profit university offering over 100 programs and concentrations with locations in multiple states including Tennessee, North Carolina, Georgia, Indiana, and others.",
  "Southern NH University": "Southern New Hampshire University is a private university offering over 200 academic programs and master's degrees both online and on campus.",
  "Specter Technologies Ltd": "Specter Technologies Limited is a software development company specializing in modern career development tools and cybersecurity solutions, with a focus on providing scalable IT services.",
  "Spectrum Brands Inc": "Spectrum Brands is a home essentials company with a mission to make living better at home, producing and marketing pet care supplies, home appliances, and lawn and garden care products.",
  "Spin Master Ltd": "Spin Master is a Canadian multinational toy and entertainment company with over 1,600 employees, co-founded by Ronnen Harary and Anton Rabie, owning 98% of voting power, and operating through divisions including Spin Master Games and Spin Master Entertainment.",
  "St Jude Childrens Research Hospital Inc": "St. Jude Children's Research Hospital is a pediatric treatment and research hospital headquartered in Memphis, Tennessee, focusing on childhood cancer and other life-threatening diseases.",
  "Standard Industries Inc": "Standard Industries is a privately-held global industrial conglomerate operating in over 80 countries with over 20,000 employees.",
  "Stanley Black & Decker Inc": "Stanley Black & Decker is a Fortune 500 American manufacturer of industrial tools and household hardware with its headquarters in the USA and over 100 manufacturing facilities worldwide.",
  "Stellantis NV": "Stellantis NV is a multinational automotive manufacturing company formed from the merger of Fiat Chrysler Automobiles and PSA Group, providing innovative mobility solutions through its constellation of 14 brands.",
  "STIHL HOLDING AG & CO KG": "STIHL Holding AG & Co KG is a family-owned holding company that develops, manufactures, and markets power tools for professional forestry, agriculture, and garden maintenance.",
  "Strategic Education Inc": "Strategic Education, Inc. (SEI) is an education services holding company that creates innovative learning experiences and focuses on enabling economic mobility through higher education.",
  "Stride Bank": "Stride Bank is an Oklahoma-based financial institution founded in 1913 with over $3 billion in assets, offering a full range of financial services including mobile and online banking.",
  "Stride Inc": "Stride, Inc. is an education management organization providing online and virtual learning services, with a focus on personalized experiences for learners of all ages and inclusive employment opportunities.",
  "Subaru Corp Local Dealer": "Subaru Corporation is a Japanese multinational corporation that operates as part of the Subaru Group, aiming to deliver value of enjoyment and peace of mind.",
  "Sub-Zero Group Inc": "Sub-Zero Group, Inc. is a privately-held American company that manufactures and sells luxury kitchen appliances including refrigerators, wine storage units, cooktops, and dishwashers.",
  "Sumitomo Corp": "Sumitomo Corporation is a leading integrated trading company with diverse businesses and a strong global network comprising 128 offices in 66 countries, established in 1919.",
  "Suntory Holdings Ltd": "Suntory Holdings Limited is a global consumer products company with annual revenue of $20.9 billion (excluding excise taxes) and produces beverages including soft drinks, spirits, beer, and wine.",
  "Swander Pace Capital Llc": "Swander Pace Capital is a leading private equity firm dedicated to investing in middle-market consumer products companies in North America.",
  "Swatch Group Ltd": "Swatch Group Ltd is an international group founded in 1983 through the merger of ASUAG and SSIH, active in the design, manufacture, and sale of watches, jewelry, watch movements, and components.",
  "Swedish Match Ab": "Swedish Match AB is a Swedish multinational tobacco company that develops, manufactures, and sells quality products including smokefree items, cigars, and lights, and was acquired by Philip Morris in February 2023.",
  "Synchrony Financial": "Synchrony Financial is an American consumer financial services company headquartered in Stamford, Connecticut, offering credit cards, financing, payment solutions, and more.",
  "Takeda Pharmaceutical Co Ltd": "Takeda Pharmaceutical Co Ltd is a global, R&D-driven pharmaceutical company with a focus on patient health and innovation, headquartered in Tokyo, Japan.",
  "Take-Two Interactive Software Inc": "Take-Two Interactive Software, Inc. is a leading developer, publisher, and marketer of interactive entertainment for consumers worldwide, headquartered in New York City.",
  "Tapestry Inc": "Tapestry, Inc. is an American multinational fashion holding company based in New York City, known for its brands Coach, Kate Spade New York, and Stuart Weitzman.",
  "Tata Motors Ltd": "Tata Motors Limited is an Indian multinational automotive company headquartered in Mumbai and part of the Tata Group, producing cars, trucks, vans, and buses.",
  "Tecovas Inc": "Tecovas is an American retailer of cowboy boots and Western-style apparel founded in 2015 by Paul Hedrick as a direct-to-consumer business based in Austin.",
  "Teladoc Health Inc": "Teladoc Health is a multinational telemedicine and virtual healthcare company that offers comprehensive care including talk therapy, diagnosis, and medication support.",
  "TeleBrands Corp": "Telebrands Corporation is an American direct response marketing company founded in 1983 and the oldest existing such company, known for creating the 'As Seen On TV' logo and category.",
  "Tempur Sealy Intl Inc": "Tempur Sealy International, Inc. is the world's largest bedding manufacturer and provider, developing, manufacturing, and marketing mattresses, adjustable bases, pillows, with a presence in over 100 countries.",
  "Tencent Holdings Ltd": "Tencent Holdings Ltd is a Chinese multinational technology conglomerate headquartered in Shenzhen, offering value-added services, online advertising, fintech, and business services.",
  "Teva Pharmaceutical Industries Ltd": "Teva Pharmaceutical Industries Ltd is an Israeli multinational pharmaceutical company primarily known for its generic drugs and commitment to delivering quality medicines globally.",
  "Texas A&M University System": "The Texas A&M University System is one of the largest systems of higher education in the nation, overseeing 11 universities and eight state agencies with a budget of $7.3 billion.",
  "Thomas H Lee Partners Lp": "Thomas H. Lee Partners, LP is an American private equity firm headquartered in Boston that focuses on investing in middle-market growth companies across Financial Technology & Services, Healthcare, and Technology & Business sectors.",
  "Thuma Inc": "Thuma Inc is a privately owned retail company based in San Francisco, California, known for its modern wood bedroom furniture with Japanese joinery and minimalist design.",
  "Tire Rack Inc": "Tire Rack is a privately owned family-run company headquartered in South Bend, Indiana, known as America's largest independent tire tester and consumer-direct source for tires, wheels, and performance accessories.",
  "Tires Plus Total Car Care": "Tires Plus Total Car Care is a network of over 500 retail tire and automotive repair facilities founded in 1972, offering services such as oil changes, batteries, tires, brakes, engine tune-ups, and more.",
  "Topgolf Callaway Brands Corp": "Topgolf Callaway Brands Corp. is a global golf equipment and entertainment company that designs, manufactures, and markets golf equipment and offers technology-enabled golf experiences.",
  "Toronto-Dominion Bank": "Toronto-Dominion Bank, founded through the merger of the Bank of Toronto and the Dominion Bank in 1955, is a major Canadian bank serving approximately 22 million customers across key financial centers.",
  "Toyo Tire & Rubber Co Ltd": "Toyo Tires is a multinational tire and rubber products company based in Itami, Japan, with operations in Asia and North America.",
  "TOYOTA MOTOR CORP LOC DLR": "Not sure",
  "Trane Technologies Plc": "Trane Technologies plc is an American-Irish company focused on heating, ventilation, and air conditioning (HVAC) and refrigeration systems, known for its commitment to climate and sustainability innovations.",
  "Tropical Smoothie Cafe": "Tropical Smoothie Cafe is a restaurant franchise operating more than 1400 locations in the United States, known for its fresh smoothies and food options, and recently acquired by Blackstone.",
  "True Classic Tees Llc": "True Classic Tees LLC produces high quality, soft, and affordable slim fitted t-shirts for men that can be worn for any occasion.",
  "Trump For President": "Donald J. Trump For President is a political campaign organization supporting Donald J. Trump's candidacy for president.",
  "TUI Ag": "TUI AG is a German multinational leisure, travel and tourism company and one of the world's leading tourism groups with operations worldwide.",
  "Tyson Foods Inc": "Tyson Foods, Inc., an American multinational corporation based in Springdale, Arkansas, is one of the world's largest food companies and a recognized leader in protein.",
  "UCB Sa": "UCB SA is a global biopharmaceutical company headquartered in Brussels, Belgium, focused on creating valuable solutions for people living with neurological and autoimmune diseases.",
  "Ultimate Medical Academy": "Ultimate Medical Academy is a nonprofit healthcare education institute offering online and blended/on-campus programs, with a national presence and over 90,000 alumni.",
  "Unilever Plc": "Unilever PLC is a British multinational consumer goods company founded in 1929, known for its global brands in nutrition, hygiene, and personal care sectors.",
  "University Of Cincinnati": "University of Cincinnati is a public research university founded in 1819 with over 53,000 students and is ranked among the top universities worldwide, known for academic excellence and experience-based learning.",
  "University Of Denver": "The University of Denver is a private research university located in Denver, Colorado, founded in 1864, with an enrollment of approximately 6,412 students and recognized as one of the top-ranking US universities.",
  "University Of MA": "UMass Amherst is a public research university in New England known for top-ranked academics and innovative research.",
  "University Of MO System": "The University of Missouri System is one of the largest employers in Missouri and is governed by a nine-member Board of Curators appointed by the governor, with day-to-day management led by the system president.",
  "University Of PA": "University of Pennsylvania is a private Ivy League research university in Philadelphia, founded in 1740 and known for prestigious graduate and professional programs.",
  "University Of Tulsa": "The University of Tulsa is a private research university located in Tulsa, Oklahoma, founded in 1894, offering programs in social & natural sciences, arts & humanities, engineering & technology, and business.",
  "University Of TX System": "The University of Texas System (UT System) is a large university system in Texas comprising 14 academic and health institutions, with over 250,000 enrolled students and significant impact globally.",
  "University Of UT": "The University of Utah is a public research university founded in 1850, located in Salt Lake City, Utah, offering over 100 undergraduate and more than 90 graduate programs.",
  "Upwork Global Inc": "Upwork Global Inc is a global freelancing platform where businesses and independent professionals connect and collaborate remotely.",
  "US Bancorp": "U.S. Bancorp is an American multinational financial services firm headquartered in Minneapolis, Minnesota and incorporated in Delaware.",
  "Us Govt": "The U.S. federal government consists of three branches: legislative, executive, and judicial, providing a range of services including government benefits, property sales, and information on various topics such as passports and Social Security.",
  "Uuni Ltd": "Uuni Limited is an outdoor pizza oven company based in Edinburgh, Scotland, founded by Kristian Tapaninaho and Darina Garland in 2012.",
  "Valentino Fashion Group Spa": "Valentino Fashion Group SpA is an Italian consortium of luxury fashion companies currently owned by Mayhoola for Investments LLC.",
  "Valve Corp": "Valve Corporation is an American video game developer, publisher, and digital distribution company founded in 1996 by Gabe Newell and Mike Harrington, headquartered in Bellevue, Washington. It is a private company owned mostly by its CEO, Gabe Newell.",
  "Valvoline Inc": "Valvoline Inc is an American retail automotive services company that provides quick, easy, and trusted automotive preventive maintenance services.",
  "Venus Fashion Inc": "Venus Fashion Inc is an American fashion company based in Jacksonville, Florida, founded in 1982, specializing in women's clothing, swimwear, and lingerie.",
  "Verizon Communications Inc": "Verizon Communications Inc is an American telecommunications company headquartered in New York City, known for providing wire line voice, data services, wireless, and internet services.",
  "Versa Capital Mgt Inc": "Versa Capital Management is a private equity investment firm focused on control investments in distressed and special situations involving middle market companies in North America with $1.2 billion of assets under management.",
  "VF Corp": "VF Corporation is an American global apparel and footwear company founded in 1899 by John Barbey and headquartered in Denver, Colorado, known for its diverse portfolio of iconic outdoor and activity-based lifestyle and workwear brands.",
  "VGW Holdings Ltd": "VGW Holdings Ltd is a developer and distributor of online social casino and poker games, operating an online gaming portal with headquarters in Perth, Australia.",
  "Viatris Inc": "Viatris is an American global pharmaceutical and healthcare corporation headquartered in Canonsburg, Pennsylvania, focused on expanding access to medicines across a wide range of therapeutic areas.",
  "Visa Usa Inc": "Visa Inc is an American multinational payment card services corporation headquartered in San Francisco, California, providing digital payments solutions and facilitating transactions globally.",
  "Vision Precision Holdings Llc": "Vision Precision Holdings, LLC is a professional eye care company providing easy eye care services in Palm Springs, Florida.",
  "Vivint Smart Home Inc": "Vivint Smart Home is a United States-based smart home and security provider that offers integrated smart home systems with in-home consultation and professional installation.",
  "Volkswagen Ag": "Volkswagen AG is a German multinational conglomerate manufacturer of passenger and commercial vehicles, with significant ownership by Porsche Automobil Holding SE (53.3%) and the State of Lower Saxony (20.0%).",
  "VSP Global": "VSP Global is a group of companies offering personalized eye care, optical, and business solutions.",
  "Vuori Clothing": "Vuori is an American contemporary clothing brand headquartered in San Diego County, California, offering athletic and performance clothing for both men and women.",
  "Wake Forest University": "Wake Forest University is a private research university located in Winston-Salem, North Carolina, founded in 1834.",
  "Walt Disney Co": "The Walt Disney Company is an American multinational mass media and entertainment conglomerate that produces and provides entertainment and information worldwide.",
  "Warby Parker": "Warby Parker is an American manufacturer and retailer of prescription glasses, contact lenses, and sunglasses founded in 2010.",
  "Warner Bros Discovery Inc": "Warner Bros. Discovery is a leading global media and entertainment company based in New York City that offers audiences a diverse portfolio of content, brands, and franchises.",
  "Washington University In St Louis": "Washington University in St. Louis is a private research university founded in 1853 located in St. Louis, Missouri, known for its academic programs and ranking in top universities.",
  "Waterdrop": "Waterdrop is a global company that develops innovative hydration products and technology platforms for insurance and healthcare services with a focus on changing the way people hydrate.",
  "Wayfair Llc": "Wayfair LLC is an American e-commerce company based in Boston, Massachusetts that sells furniture and home goods online.",
  "Wells Fargo & Co": "Wells Fargo & Company is an American multinational financial services company with approximately $1.9 trillion in assets and operates in 35 countries.",
  "Western Governors University": "Western Governors University (WGU) is a private, nonprofit online university based in Millcreek, Utah, focused on offering affordable, accredited, and career-aligned degree programs through an innovative competency-based approach.",
  "Whirlpool Corp": "Whirlpool Corporation is an American multinational manufacturer and marketer of home appliances headquartered in Benton Charter Township, Michigan, and it is a leading U.S.-based company focused on improving life at home through innovation.",
  "Wingstop Inc": "Wingstop Inc., founded in 1994 and headquartered in Dallas, TX, is an American international chain of restaurants primarily selling buffalo wings and other flavored wing options with over 1,450 locations worldwide.",
  "WK Kellogg Co": "WK Kellogg Co is an American food manufacturing company headquartered in Battle Creek, Michigan, that was split from Kellogg Company on October 2, 2023, and operates as a leading manufacturer, marketer, and distributor of branded ready-to-eat cereal in the U.S., Canada, and the Caribbean.",
  "WM Barr & Co": "WM Barr & Company, Inc., founded in 1946 by William M. Barr, is an employee-owned consumer goods company manufacturing specialty cleaning, home improvement, and automotive refinishing products.",
  "Wolverine Worldwide Inc": "Wolverine Worldwide is a publicly traded American footwear manufacturer that designs, markets, and distributes a variety of branded casual, active lifestyle, work, outdoor sport, athletic, children's, and uniform footwear and apparel products.",
  "WW Grainger Inc": "W. W. Grainger, Inc., is a leading broad line distributor of industrial maintenance, repair, and operating (MRO) products with operations primarily in North America, Japan, and the United Kingdom.",
  "X-Chair Llc": "X-Chair LLC manufactures and sells ergonomic office chairs with adjustable features designed for comfort and support, and is now part of the Exemplis brand portfolio.",
  "Yeti Coolers Llc": "YETI Coolers LLC designs, manufactures, and markets ice chests and other outdoor recreation products such as coolers and drinkware.",
  "Yurman Design Inc": "Yurman Design Inc is a privately held American jewelry company founded by David Yurman and Sybil Kleinrock Yurman, known for its luxury jewelry and timepieces, headquartered in New York City.",
  "Zeelool Inc": "Zeelool Inc. is a private company based in Wilmington, Delaware that offers fashionable and affordable eyewear including glasses and sunglasses online.",
  "Zenbivy": "Zenbivy is a company that designs and sells backpacking sleep systems, including beds, quilts, and mattresses, which are meant to mimic the comfort of home sleeping arrangements for outdoor use.",
  "Zenni Optical Inc": "Zenni Optical is an American online retailer of prescription glasses and sunglasses founded in 2003 by Tibor Laczay, offering affordable eyewear with a mission to make it accessible to everyone.",
  "ZipRecruiter": "ZipRecruiter is an American employment marketplace that helps job seekers find job openings and employers post jobs on multiple boards.",
  "Zoetis Inc": "Zoetis is an American drug company and the world's largest producer of medicine and vaccinations for pets and livestock, committed to advancing care for animals.",
  "iHeartMedia Inc": "iHeartMedia is a leading global media and entertainment company specializing in radio, digital, mobile, social, live events, and on-demand entertainment, with its flagship digital platform iHeartRadio offering thousands of live radio stations and personalized content.",
  "Puffs": "Puffs from Procter & Gamble Co. offers a range of soft and strong facial tissues, including lotionless and ultra-soft options, designed for comfort and gentle use on sensitive skin.",
  "Swiffer Duster": "The Swiffer Duster from Procter & Gamble Co. is a versatile dusting tool featuring thousands of fluffy fibers with Dust Lock Adhesive, designed to trap and lock dust and allergens from various surfaces.",
  "Native Mineral": "Native Mineral is a line of naturally derived personal care products from Procter & Gamble Co., known for being sulfate-free, paraben-free, and cruelty-free, with a focus on clean and simple formulations[1][3][4].",
  "Head & Shoulders": "Head & Shoulders, a leading brand from Procter & Gamble Co., is the world's largest-selling anti-dandruff shampoo, known for its effective zinc pyrithione formula that tackles dandruff while being gentle on hair.",
  "Oral-B Floss Action": "Oral-B Floss Action from Procter & Gamble Co. offers advanced MicroPulse bristles that provide a floss-like clean, effectively removing plaque and promoting healthier gums with its unique floss action bristles[2][4].",
  "Zevo Trap": "The Zevo Flying Insect Trap, a product from Procter & Gamble Co., uses blue and UV light to attract and trap house flies, fruit flies, and gnats, eliminating them without odors or messes[1][2][4].",
  "Bevel": "Bevel, a brand under Procter & Gamble Co., offers a range of grooming and personal care products specifically designed to address the unique needs of Black men, including shaving solutions, skincare, and body care, all while maintaining authenticity and inclusivity[1][2][5].",
  "Head & Shoulders Anti-Comezon": "Head & Shoulders Anti-Comezon is a shampoo from Procter & Gamble Co., designed to provide an immediate refreshing sensation and alleviate dandruff and itching, leaving the scalp up to 100% free of flaking and irritation[1][2][4].",
  "Voost": "Voost, a brand from Procter & Gamble Co., offers a range of effervescent vitamins and supplements, including energy boosters, hydration aids, and gummies, designed to meet various health and wellness needs with innovative formulations and flavors[1][2][5].",
  "Ariel Revita Color": "Ariel Revita Color is a laundry detergent from Procter & Gamble Co., specifically designed to care for and preserve the colors of your clothes, while also removing tough stains and brightening whites[3].",
  "Swiffer Wet": "Swiffer Wet from Procter & Gamble Co. is an all-in-one mopping system that uses disposable pads and a dual-nozzle sprayer to break up and dissolve tough messes, providing a convenient and efficient cleaning solution for various floor types[2][4][5].",
  "Old Spice Fiji": "Old Spice Fiji is a tropical-scented antiperspirant and deodorant by Procter & Gamble, characterized by citrus and coconut notes, designed to evoke the freshness of palm trees and sunshine[1][2][4].",
  "Always Pure": "Always Pure, a brand from Procter & Gamble Co., offers organic and premium cotton pads with FlexFoam technology, providing zero-leak and zero-feel protection for women during their menstrual cycles[1][2][5].",
  "Bold 3": "Bold 3 from Procter & Gamble Co. is a laundry detergent brand offering various products, including the Bold 3 in 1 Lavender & Camomile Liquid Pods and the Bold 3D Antibacterial Laundry Balls, known for their effective cleaning and fragrance delivery in laundry care[1][2][4].",
  "Braun Shaving & Hair Removal Products": "Braun Shaving & Hair Removal Products from Procter & Gamble Co. offer a range of innovative solutions, including IPL hair removal devices, electric shavers, and epilators, designed for long-lasting hair reduction and smooth skin maintenance at home[1][2][4].",
  "Align Probiotic Digestive Support": "Align Probiotic Digestive Support, from Procter & Gamble Co., is a #1 doctor-recommended probiotic supplement that contains the unique strain Bifidobacterium 35624TM, helping to relieve occasional abdominal discomfort, gas, and bloating while maintaining digestive balance[1][3][4].",
  "Pampers Free & Gentle": "Pampers Free & Gentle baby wipes, from Procter & Gamble Co., are hypoallergenic, unscented, and 100% plant-based, designed to provide a superior clean while protecting delicate skin with a pH-balancing formula[1][4].",
  "Mielle Organics": "Mielle Organics is a Black-owned haircare brand acquired by Procter & Gamble, known for its natural, organic products designed to support healthy hair and skin, particularly for textured hair types, while maintaining its commitment to community empowerment and education.",
  "Align Yogurt Coated Probiotic Fruit Bites": "Align Yogurt Coated Probiotic Fruit Bites from Procter & Gamble Co. are bite-sized, apple blueberry flavored snacks coated in yogurt that contain probiotics to support digestive health, recommended by doctors as the #1 probiotic brand[1][3][5].",
  "Vicks Pure Zzzs": "Vicks Pure Zzzs is a line of drug-free, non-habit forming sleep aids from Procter & Gamble Co., offering melatonin gummies and other products to help individuals fall asleep naturally and regulate their sleep cycles without next-day grogginess[1][3][5].",
  "NyQuil Z": "NyQuil Z is a sleep aid product from Procter & Gamble Co., specifically designed to help individuals fall asleep and stay asleep without causing next-day drowsiness, containing diphenhydramine HCI as its active ingredient[2][3].",
  "Tide Pods": "Tide Pods from Procter & Gamble Co. are compact, 3-in-1 laundry detergent pacs containing a cleanser, brightener, and fabric softener, designed for easy use in both hot and cold water.",
  "Nyquil": "NyQuil, a brand from Procter & Gamble Co., is a multi-symptom nighttime cold and flu medication that provides fast relief for symptoms like cough, sneezing, and sinus congestion, helping users get restful sleep[1][3][5].",
  "Ariel": "Ariel is a renowned laundry detergent brand from Procter & Gamble, known for its effective stain removal, innovative formulas, and commitment to sustainability, available in various forms including powder, liquid, and pods[1][2][5].",
  "Olay Cleansing": "Olay Cleansing Melts from Procter & Gamble Co. are water-activated pads that dissolve into a rich, creamy microbubble lather, providing a 3X better clean, toning, and refreshing the skin for all skin types[1][2].",
  "Secret Aluminum Free": "Secret Aluminum Free Deodorant from Procter & Gamble Co. is an aluminum-free, dermatologist-tested deodorant offering 48 hours of odor protection with gentle, moisturizing ingredients and a commitment to PETA-certified cruelty-free practices[1][2].",
  "Secret Outlast": "Secret Outlast from Procter & Gamble Co. is a line of antiperspirant and deodorant products offering 72-hour sweat and odor protection, fighting 99% of odor-causing bacteria, and providing a clear, residue-free application for long-lasting freshness.",
  "Ariel Color De Luxe": "Ariel Color De Luxe from Procter & Gamble Co. is a premium laundry detergent designed to maintain vibrant colors and provide excellent stain removal without fading or bleaching colors[1][4].",
  "Always Ultra": "Always Ultra from Procter & Gamble Co. offers ultra-thin sanitary pads with a 3X Protection System, featuring RapidDRY technology, LeakGUARD core, and OdorLOCK to provide long-lasting, leak-free comfort and freshness[2][3][4].",
  "Olay Body Collection": "The Olay Body Collection from Procter & Gamble Co. offers a range of premium body care products, including exfoliating body washes, hydrating body lotions, and dermatologist-designed moisturizers, all backed by over 65 years of skin science to deliver visible skin transformation and hydration for various skin types[1][2][5].",
  "Dawn Ultra": "Dawn Ultra from Procter & Gamble Co. is a powerful, concentrated dishwashing liquid that cleans stuck-on food efficiently, requires 50% less scrubbing, and is trusted by wildlife rescue workers for its effectiveness in cleaning oil-affected wildlife[1][2][3].",
  "Zevo": "Zevo, a Procter & Gamble brand, offers innovative, eco-friendly insect control products using essential oils and BioSelective Technology to target bugs without harming humans or pets.",
  "Prilosec OTC": "Prilosec OTC from Procter & Gamble Co. is an over-the-counter proton pump inhibitor used to treat frequent heartburn by reducing gastric acid secretion, available in a delayed-release 20mg tablet.",
  "Tide Evo": "Tide Evo is a revolutionary, dissolvable laundry detergent tile from Procter & Gamble Co., offering a concentrated, eco-friendly clean with zero fillers and no plastic bottles, designed for efficient and sustainable laundry care[1][2][4].",
  "Tide To Go": "Tide To Go from Procter & Gamble Co. is a portable, instant stain remover pen that offers 50% more stain-fighting power and faster dry time, designed for quick and effective removal of various food and drink spills on fabrics[1][3].",
  "Gain Relax": "Gain Relax from Procter & Gamble Co. is a line of laundry products, including fabric softener and liquid detergent, known for their soothing scents and long-lasting freshness, designed to transform laundry routines into relaxing self-care rituals[1][4].",
  "Febreze Air Mist": "Febreze Air Mist from Procter & Gamble Co. is an innovative air freshener that neutralizes odors with its special odor-neutralizing technology, available in various scents to promote whole-home freshness and emotional connection through its unique fragrances like Romance & Desire[1][5].",
  "Herbal Essences Color Nurture": "Herbal Essences Color Nurture Shampoo from Procter & Gamble Co. is a sulfate-free, nourishing shampoo that protects and enhances color-treated hair with natural ingredients like grapeseed and camellia oil.",
  "Swiffer Dry": "Swiffer Dry from Procter & Gamble Co. is a line of disposable cleaning cloths and dusters designed to trap and lock dirt, dust, and allergens using electrostatic technology, offering a convenient and efficient cleaning solution for various surfaces[1][2][5].",
  "Ariel Doble Poder": "Ariel Doble Poder from Procter & Gamble Co. is a laundry detergent that penetrates deep into fibers, removes tough stains effectively, and leaves clothes with a fresh and clean scent, making it safe for color laundry[2][3][5].",
  "Tampax Pearl": "Tampax Pearl tampons from Procter & Gamble Co. offer leakproof, comfortable protection with up to 8 hours of absorbency, featuring a smooth applicator and CleanGuard technology for added protection[1][2][4].",
  "Dolo-Neurobion": "Dolo-Neurobion, manufactured by Procter & Gamble Philippines Inc., is a film-coated tablet containing paracetamol and vitamins B1, B6, and B12, used to relieve mild to moderate pain, including joint and nerve-related conditions[1][2][4].",
  "Gillette": "Gillette, owned by Procter & Gamble Co., is a renowned American brand of safety razors and personal care products, known for its innovative shaving technology and commitment to quality, innovation, and sustainability[1][2][5].",
  "Vicks Pyrena": "Vicks Pyrena from Procter & Gamble Co. is a line of cough drops and other respiratory products known for their soothing and relieving properties, offering various flavors like ma e canela (apple and cinnamon) for consumers seeking quick relief from coughs and colds[1][4].",
  "Ivory Snow": "Ivory Snow is a gentle and effective laundry detergent specifically designed for babies' delicate skin, recommended by pediatricians and available in various scents and formats, including pacs and liquid detergent[1][2].",
  "Escudo": "Escudo is a leading local antibacterial soap brand in Mexico and other Latin American countries, which was previously owned by Procter & Gamble Co. before being divested to Kimberly-Clark de Mxico S.A.B. de C.V. in 2016[1][3][4].",
  "Cascade Platinum": "Cascade Platinum from Procter & Gamble Co. is a high-performance dishwasher detergent that effectively cleans burnt-on food and grease with no pre-wash needed, using a triple-chamber design and the grease-fighting power of Dawn, while also preventing hard water spots and filming[1][2].",
  "Braun All-In-One": "Braun All-In-One from Procter & Gamble Co. is a versatile, 11-in-1 to 17-in-1 grooming kit offering head-to-toe trimming, featuring ultra-sharp blades, AutoSense technology, and a powerful Li-Ion battery for durable, waterproof performance[1][2][4].",
  "Pepto-Bismol": "Pepto-Bismol, a product from Procter & Gamble Co., is an over-the-counter medication used to treat diarrhea, upset stomach, nausea, heartburn, and indigestion, providing quick relief from digestive issues[1][3][4].",
  "Crest Cavity Protection": "Crest Cavity Protection from Procter & Gamble Co. is a toothpaste designed to provide cavity protection and fluoride-based oral care, helping to prevent tooth decay and promote healthy teeth and gums[1][2][5].",
  "ILoveGain.com": "ILoveGain.com is the official website for Gain laundry and dish detergents, offering a variety of fresh-smelling products and convenient packaging options from Procter & Gamble Co. [1][2]",
  "Native Hair": "Native Hair, a line from Procter & Gamble Co., offers naturally derived, sulfate-free, and paraben-free hair care products designed to cater to specific hair needs with clean, simple formulas.",
  "Cascade": "Cascade from Procter & Gamble Co. is the #1 recommended dishwasher detergent brand, known for its powerful cleaning and shining results, offering a range of products including ActionPacs, gel detergents, and additives to deliver a brilliant clean for various dishwashing needs[1][2][4].",
  "Nyquil Severe": "NyQuil SEVERE from Procter & Gamble Co. is a maximum strength, nighttime cough, cold, and flu relief medication that provides fast and powerful 9-symptom relief, including coughing, sneezing, and fever, to help you rest.",
  "Olay": "Olay is an American skin care brand owned by Procter & Gamble, offering a wide range of products aimed at transforming and rejuvenating skin through scientifically formulated ingredients and innovative skincare solutions[1][2][5].",
  "Braun": "Braun from Procter & Gamble Co. is a renowned brand for small electrical appliances, including shavers, epilators, and electric toothbrushes, known for its innovative designs and high-quality products in grooming and hair care.",
  "Downy Comfy Cozy": "Downy Comfy Cozy from Procter & Gamble Co. is a 2-in-1 laundry additive that combines premium scent and softness, providing a multisensorial feeling of comfort with its long-lasting, toasted vanilla fragrance.",
  "Zzzquil Pure Zzzs": "ZzzQuil PURE Zzzs is a line of natural, non-habit forming sleep aids from Procter & Gamble Co., including melatonin gummies and liquids, designed to help individuals fall asleep naturally and wake up without grogginess[2][3].",
  "New Chapter Bone Strength Take Care": "New Chapter Bone Strength Take Care, a supplement from New Chapter (a brand under Procter & Gamble Co.), supports bone health, joint flexibility, and cardiovascular well-being with plant-sourced calcium and essential vitamins.",
  "Tampax": "Tampax, a brand owned by Procter & Gamble Co., offers a range of tampons designed for all-day comfort and protection, including the Pearl and Radiant lines, with features like LeakGuard Braid and FormFit technology to prevent leaks and ensure confidence during periods[1][2][4].",
  "Whisper Ultra": "Whisper Ultra from Procter & Gamble Co. is a premium sanitary pad offering superior absorbency, 100% wetness lock, and a comfortable fit, designed to provide long-lasting protection and confidence for women during their menstrual cycle[2].",
  "Sinex": "Sinex, a brand from Procter & Gamble Co., offers a range of over-the-counter medications designed to provide relief from sinus symptoms, including nasal sprays and liquid capsules, with a focus on long-lasting and fast-acting relief[1][3].",
  "Olay Niacinamide": "Olay Niacinamide from Procter & Gamble Co. is a skincare ingredient that strengthens the skin's moisture barrier, improves skin texture, and reduces the appearance of dark spots and fine lines, utilizing 99% pure niacinamide for enhanced hydration and skin tone improvement[1][3].",
  "Herbal Essences Sulfate Free": "Herbal Essences Sulfate Free shampoos from Procter & Gamble Co. offer deeply nourished, weightlessly soft hair with natural ingredients like camellia oil and honey, while being free of sulfates, parabens, dyes, and phthalates[1][4].",
  "DentureLiving.com": "DentureLiving.com is a resource provided by Procter & Gamble's Fixodent brand, offering expert advice, product information, and community support for denture wearers.",
  "Aussie": "Aussie, a hair care brand from Procter & Gamble Co., specializes in using Australian botanicals to create products for various hair types, including shampoos, conditioners, and styling products, known for their moisturizing and detangling properties[1][2][3].",
  "Always Corporate": "Always is a Procter & Gamble brand offering a range of menstrual hygiene products, including maxi pads, ultra thin pads, pantyliners, and disposable underwear, known for its global presence and innovative marketing campaigns promoting women's empowerment[1].",
  "Always": "Always is an American brand of menstrual hygiene products, including maxi pads, ultra thin pads, pantyliners, and disposable underwear, developed by Procter & Gamble and introduced in the United States in 1983[1].",
  "Whisper": "Whisper, a brand from Procter & Gamble Co., is a premium feminine hygiene product known for its high-quality sanitary napkins and innovative marketing strategies aimed at breaking menstrual hygiene taboos and promoting female empowerment.",
  "Zirh Store": "Zirh is a premium, high-end male grooming brand acquired by Procter & Gamble Co., offering upscale skincare and shaving essentials designed specifically for men.",
  "NyQuil Severe Vapocool": "NyQuil Severe VapoCOOL from Procter & Gamble Co. is a maximum-strength nighttime cold and flu relief liquid that provides fast, powerful 9-symptom relief with a cooling rush of Vicks Vapors, helping to treat cough, sneezing, stuffy nose, minor body pain, and other common cold and flu symptoms[1][2][3].",
  "Olay Regenerist": "Olay Regenerist is a line of anti-aging skincare products from Procter & Gamble Co., featuring ingredients like retinol and niacinamide to promote smoother, firmer, and more radiant skin.",
  "Pampers Cruisers 360": "Pampers Cruisers 360 from Procter & Gamble Co. offers 360-degree stretchy waistbands and leak-proof protection, designed for active babies with a flexible, gap-free fit and easy pull-up functionality[1][2][3].",
  "Dawn Platinum": "Dawn Platinum from Procter & Gamble Co. is a premium dish soap known for its powerful, concentrated formula that easily removes 99% of grease and food residue, while also being gentle enough for wildlife rescue applications and offering various scents and multi-surface cleaning capabilities[1][2][3].",
  "Tide": "Tide, a brand from Procter & Gamble Co., is the highest-selling laundry detergent globally, known for its high-power grease-cutting formula and ability to keep clothes clean and fresh, available in various forms including liquid and pods[1][2][4].",
  "Herbal Essences Bio Renew": "Herbal Essences Bio Renew is a line of sulfate-free, botanical-based shampoos and conditioners from Procter & Gamble, authenticated by the Royal Botanic Gardens, Kew, and certified by the Environmental Working Group (EWG) for their high standards of safety and transparency[1][2][3].",
  "Zirh": "Zirh, a premium male grooming brand acquired by Procter & Gamble, offers high-end skincare and shaving products designed with advanced technology and finest ingredients for a comprehensive grooming experience.",
  "Pampers Easy Ups": "Pampers Easy Ups from Procter & Gamble Co. are training underwear designed with a 360 stretchy waistband, extra absorbent channels, and dual leak-guard barriers for up to 100% leakproof protection, providing a comfortable, underwear-like fit for toddlers during potty training[1][2][3].",
  "Always Discreet": "Always Discreet from Procter & Gamble Co. offers a range of incontinence products, including underwear and pads, designed for comfort, protection, and discretion with advanced technologies like RapidDry and OdorLock to manage bladder leaks effectively.",
  "Vicks Childrens Sinex": "Vicks Sinex Children's Saline Nasal Mist is a drug-free, preservative-free, ultra-fine saline mist designed for kids aged 1+, providing instant relief from nasal congestion caused by colds and allergies[1][4].",
  "Mr Clean Magic Toilet": "The Mr. Clean Magic Toilet Foaming Cleaner from Procter & Gamble Co. is a convenient, septic-safe toilet cleaner that activates with water to quickly remove tough stains and leave a fresh scent, eliminating the need for messy liquids and plastic bottles[2].",
  "Bold": "Bold is a laundry detergent brand from Procter & Gamble Co., known for its effective cleaning and freshness, available in various formulations including 2-in-1, 3-in-1, and 4-in-1 gel ball versions[1][2][5].",
  "Pampers": "Pampers, a brand from Procter & Gamble Co., offers a range of innovative, hypoallergenic, and leak-resistant disposable diapers designed to provide comfort and protection for babies throughout various stages of development[1][3].",
  "Metamucil Psyllium Fiber": "Metamucil Psyllium Fiber, a product from Procter & Gamble Co., is a dietary supplement that uses psyllium husk to promote digestive health, maintain healthy blood sugar levels, support heart health by lowering cholesterol, and reduce hunger between meals.",
  "Tide Stain Release": "Tide Ultra Stain Release from Procter & Gamble Co. is a liquid laundry detergent designed to remove up to 99% of everyday stains, including greasy food stains, for a deep-down clean and fresh laundry[1][3][5].",
  "Always Maxi": "Always Maxi from Procter & Gamble Co. offers advanced 3X Protection System pads with RapidDRY, LeakGUARD, and SecurelyFITS technology for up to 100% leak-free comfort and superior period protection.",
  "Gain": "Gain from Procter & Gamble Co. is a laundry detergent known for its fresh, long-lasting scents and effective cleaning abilities, available in various forms including powdered and pod formats[1][3][5].",
  "Crest": "Crest is an American brand of toothpaste and oral hygiene products from Procter & Gamble, known for introducing fluoride chemistry to dental care and expanding its product line to include toothbrushes, mouthwash, and whitening strips[1][4].",
  "Tide Free & Gentle": "Tide Free & Gentle from Procter & Gamble Co. is a hypoallergenic, dye-free, and perfume-free liquid laundry detergent that provides a deeper clean while being gentle on skin, recommended by dermatologists for sensitive skin.",
  "Pantene": "Pantene is a brand of hair care products owned by Procter & Gamble, known for its Pro-Vitamin B5 formula and global marketing campaigns emphasizing healthy, beautiful hair[1][2][4].",
  "Bounce Dryer Bar": "The Bounce Dryer Bar from Procter & Gamble Co. is a fabric softener that provides freshness, softness, and static control for about two to four months, depending on usage and dryer settings, by being mounted inside the dryer and forgotten[1][2][4].",
  "Oral-B IO": "The Oral-B iO from Procter & Gamble Co. is an advanced electric toothbrush featuring a linear magnetic drive, micro-vibrations, and smart pressure sensors, designed to enhance plaque removal and promote proper brushing technique with real-time guidance and AI-powered tracking[1][2][3].",
  "Bounty": "Bounty, a brand from Procter & Gamble Co., offers highly absorbent and durable 2-ply paper towels known as \"the quicker picker-upper,\" ideal for cleaning up spills and messes efficiently[1][3][4].",
  "Secret Clinical Strength": "Secret Clinical Strength from Procter & Gamble Co. offers clinically proven, 72-hour sweat and odor protection for three types of sweatstress, heat, and activitywhile being certified cruelty-free by PETA[1][2][3].",
  "Metamucil": "Metamucil, a Procter & Gamble brand, is a leading fiber supplement made from psyllium husk, promoting digestive health, regularity, and heart health by lowering cholesterol.",
  "Zzzquil Night Pain": "ZzzQuil Night Pain is a non-habit-forming sleep aid and pain reliever from Procter & Gamble Co., designed to help individuals fall asleep fast and wake up refreshed by combining diphenhydramine HCI and acetaminophen.",
  "Art Of Shaving Shop": "The Art of Shaving, a high-end men's grooming brand acquired by Procter & Gamble Co. in 2009, offers elegant, hand-crafted shaving accessories and products designed to elevate the shaving experience.",
  "Pepto-Bismol Fast Melts": "Pepto-Bismol Fast Melts, a product from Procter & Gamble Co., is a fast-acting, chewable tablet that provides relief from nausea, heartburn, indigestion, upset stomach, and diarrhea with a fresh berry flavor.",
  "Procter & Gamble Co": "Procter & Gamble (P&G) is a multinational consumer goods corporation specializing in personal health, personal care, and hygiene products, with a diverse portfolio of over 65 brands across various categories.",
  "DayQuil High Blood Pressure": "DayQuil High Blood Pressure from Procter & Gamble Co. is a non-drowsy, decongestant-free, and sugar-free liquid medication specifically formulated for people with high blood pressure to relieve common cold and flu symptoms like headache, fever, and cough.",
  "Zevo Max": "Zevo Max is a flying insect trap from Procter & Gamble Co. that uses a blue and UV light system with two mess-free sticky cartridges to attract and capture house flies, fruit flies, and gnats in a 360-degree design, providing 24/7 protection for homes[1][2][5].",
  "Dawn": "Dawn, a brand from Procter & Gamble Co., is a leading dish soap known for its powerful grease-cutting capabilities and innovative formulas that make washing dishes more efficient and effective.",
  "Downy Unstopables": "Downy Unstopables from Procter & Gamble Co. is an in-wash scent booster that provides long-lasting freshness and a vibrant scent for up to 12 weeks, using touch-activated technology to release fragrance micro-capsules during wear[1][2].",
  "Head & Shoulders Classic Clean": "Head & Shoulders Classic Clean is a paraben-free, clinically proven 2-in-1 anti-dandruff shampoo and conditioner from Procter & Gamble Co., designed to protect against flakes, itch, oil, and dryness while providing a light, fresh scent and pH-balanced formula for daily use[1][4].",
  "Swiffer Dry & Wet": "Swiffer Dry & Wet from Procter & Gamble Co. is a 2-in-1 hard surface floor cleaner that combines sweeping and mopping capabilities with fluffy 3D fibers and pre-moistened cloths to trap and dissolve dirt, dust, and hair effectively[1][2][5].",
  "Pantene Oil Replacement": "Pantene Oil Replacement from Procter & Gamble Co. is a leave-on conditioner that intensively regenerates damaged hair, reduces hair fall, and provides protection against styling and blow-drying damage, all while offering a non-sticky, creamy texture and deep nourishment with vitamins B, C, and E[1][3][4].",
  "King C Gillette": "King C. Gillette, the founder of the Gillette Safety Razor Company, revolutionized personal grooming with his invention of the disposable safety razor, which is now part of Procter & Gamble's portfolio of men's grooming products[3].",
  "Ariel Ultra": "Ariel Ultra is a line of laundry detergents from Procter & Gamble Co., offering concentrated formulas with advanced stain-fighting power and eco-friendly cleaning options for various fabrics[1][2][3].",
  "Crest Gum Detoxify": "Crest Gum Detoxify is a toothpaste by Procter & Gamble Co., clinically proven to neutralize harmful plaque bacteria around the gum line, promoting healthier gums and reducing gingivitis.",
  "Native Whole Body": "Native Whole Body Deodorant from Procter & Gamble Co. offers clinically-proven 72-hour odor protection, is free from aluminum salts, parabens, baking soda, dye, and talc, and is available in four scents for whole-body use.",
  "Always Fresh": "Always Fresh is a brand from Procter & Gamble Co. that specializes in fresh berries, emphasizing quality and community passion in their farming and distribution practices[3].",
  "Vicks BabyBalm": "Vicks BabyBalm, from Procter & Gamble Co., is a soothing balm designed for babies 3 months and above, containing aloe vera, coconut oil, and fragrances like lavender and rosemary to provide moisturizing and relaxing care[1][3].",
  "Swiffer WetJet": "Swiffer WetJet is an all-in-one mopping system by Procter & Gamble that breaks up and dissolves tough messes with its unique dual-nozzle sprayer and powerful cleaning solution, providing a deep clean on various floor surfaces[1][2][4].",
  "Charmin Super Mega Roll": "Charmin Super Mega Roll is a long-lasting, 2-ply toilet paper offering ultra-soft comfort and 2X more absorbency compared to leading bargain brands, available in various sizes including Ultra Strong and Ultra Soft options[1][2][4].",
  "Braun Silk-Epil": "Braun Silk-Epil, a line of epilators from Procter & Gamble Co., offers precise hair removal with advanced MicroGrip tweezers technology, ensuring smooth skin for up to a month without the need for wax or chemicals[1][2][3].",
  "Pampers Sensitive": "Pampers Sensitive Wipes from Procter & Gamble Co. are clinically proven, hypoallergenic, and gentle on baby's delicate skin, featuring a low-pH buffering system and no harsh chemicals like phenoxyethanol, parabens, perfume, or alcohol[1][2][4].",
  "Febreze Air Effects": "Febreze Air Effects from Procter & Gamble Co. is an aerosol air freshener that eliminates tough odors, such as pet, bathroom, and smoke smells, with a light, clean scent[1][2].",
  "Crest 3D White": "Crest 3D White from Procter & Gamble Co. offers a line of tooth whitening products, including strips and toothpaste, designed to remove stains and whiten teeth effectively and safely.",
  "Febreze Plug": "Febreze Plug is a scented oil plug-in air freshener from Procter & Gamble, offering adjustable fragrance levels and interchangeable scent options for continuous, lasting freshness in any room[2].",
  "New Chapter": "New Chapter, a subsidiary of Procter & Gamble, is a leading brand of organic dietary supplements committed to sustainability, ethical sourcing, and personalized wellness, offering a range of herbal supplements, probiotics, and superfood products certified as non-GMO and organic.",
  "Bounce Free & Gentle": "Bounce Free & Gentle Fabric Softener Dryer Sheets from Procter & Gamble Co. are dermatologist-tested, hypoallergenic, and fragrance-free, designed to reduce static and wrinkles while softening clothes gently on sensitive skin.",
  "Old Spice Gentlemans Blend": "Old Spice Gentleman's Blend is a line of male grooming products from Procter & Gamble, offering a range of deodorants, body washes, and other personal care items in various scents, known for their gentle and effective formulations.",
  "Pampers Splashers": "Pampers Splashers are disposable swim diapers designed by Procter & Gamble Co., featuring a 360 stretchy waistband and Dual Leak-Guard Barriers for a gap-free fit and mess containment[5].",
  "Oral-B Genius": "The Oral-B Genius from Procter & Gamble Co. is a line of advanced electric toothbrushes featuring Bluetooth connectivity, customizable SmartRings, and AI-driven brushing recognition technology to provide real-time feedback and improve oral hygiene.",
  "New Chapter Every Womans One Daily": "New Chapter's Every Woman's One Daily multivitamin, formulated by Procter & Gamble, is a fermented, whole-food nutrient supplement designed to support women's overall wellness, immune function, cellular energy, and beauty, with a focus on ease of digestion and absorption[1][3].",
  "Vicks VapoShower": "Vicks VapoShower from Procter & Gamble Co. are non-medicated shower tablets that infuse soothing vapors with eucalyptus and essential oils, menthol, and camphor to enhance relaxation and breathing during cold and flu season.",
  "Procter & Gamble Professional Line": "Procter & Gamble Professional Line offers a range of trusted, high-efficiency cleaning solutions and equipment designed to meet the needs of commercial and away-from-home businesses, ensuring sparkling cleanliness and safety[1][4][5].",
  "Always Flexi-Style": "Always Flexi-Style pantyliners from Procter & Gamble Co. are flexible, ultra-thin, and breathable, designed to fit all styles of underwear while providing long-lasting freshness and odor protection.",
  "Olay Super Serum": "Olay Super Serum is a 5-in-1 face serum from Procter & Gamble Co., offering hydration, smoothing, firming, brightening, and evening skin tone with potent ingredients like niacinamide, vitamin C, collagen peptides, and alpha hydroxy acid (AHA)[1][3][5].",
  "Old Spice Raptorstrike": "Old Spice Raptorstrike is an aluminum-free deodorant for men, offering triple protection and a long-lasting dark berry scent for 24/7 freshness.",
  "Metamucil Fiber": "Metamucil Fiber from Procter & Gamble Co. is a plant-based psyllium fiber supplement that promotes digestive health, maintains healthy blood sugar levels, and helps lower cholesterol by forming a viscous gel that traps and removes waste and sugars.",
  "Old Spice Ocean Legend": "Old Spice Ocean Legend, from Procter & Gamble Co., is an antiperspirant and deodorant that combines the freshness of ocean elements with citrus and floral notes, offering long-lasting protection and a refreshing scent[1][2].",
  "Tide Power Pods": "Tide Power PODS from Procter & Gamble Co. are innovative laundry pacs that deliver more chemistry to clean deep between fibers, offering powerful stain and odor removal in a convenient, compact package[1][3].",
  "Vicks": "Vicks, a brand of over-the-counter medications owned by Procter & Gamble, offers a range of products including NyQuil, DayQuil, VapoRub, and cough medicines, known for relieving coughs and minor muscle and joint pain.",
  "Mr Clean Magic Eraser": "The Mr. Clean Magic Eraser from Procter & Gamble Co. is a powerful, all-purpose cleaning tool that uses micro-scrubbers to lift away dirt and grime with just water, suitable for various household and outdoor cleaning tasks.",
  "Native": "Native, a personal care brand acquired by Procter & Gamble Co., offers clean and effective products from naturally derived ingredients, including deodorant, body wash, hand & body lotion, shampoo, and conditioner, known for their cruelty-free and vegan formulations[2][3][4].",
  "Oral-B": "Oral-B, a leading oral hygiene brand from Procter & Gamble Co., offers a wide range of toothpastes, toothbrushes, electric toothbrushes, and mouthwashes, known for their innovative designs and high standards of safety and efficacy, including the first electric toothbrush to be accepted by the American Dental Association (ADA) [1][2][4].",
  "Febreze Small Spaces": "Febreze Small Spaces from Procter & Gamble Co. are compact air fresheners designed to eliminate odors in tiny spaces like bathrooms, closets, and laundry rooms, offering continuous freshness for up to 45 days with various scents like Linen & Sky and Mountain Air[1][2][5].",
  "This Is L": "This Is L, acquired by Procter & Gamble, is a purpose-driven feminine care brand offering organic cotton tampons, pads, liners, and wipes, with a commitment to donating to causes improving girls' and women's access to period products worldwide[1][3][5].",
  "Vicks Act 7": "Vicks Act 7 is a single-tablet solution from Procter & Gamble Co., combining paracetamol, caffeine, chlorphenamine, and phenylephrine to alleviate the seven primary symptoms of cold and flu, such as headache, body aches, sneezing, watery eyes, sore throat, nasal congestion, and fever[1].",
  "Mr Clean": "Mr. Clean is a brand of cleaning products from Procter & Gamble Co., known for its powerful and versatile cleaning solutions, including the iconic Magic Eraser, which effectively removes tough stains and grime with minimal effort[1][3][4].",
  "Crest Pro-Health": "Crest Pro-Health from Procter & Gamble Co. is a toothpaste that provides comprehensive oral care by preventing cavities, gingivitis, plaque, and tooth sensitivity, while also whitening teeth and freshening breath.",
  "Febreze Fade Defy": "Febreze Fade Defy is a smart plug-in air freshener from Procter & Gamble Co. that uses microchip technology to maintain a consistent, long-lasting fresh scent for up to 50 days.",
  "Align Bloating Relief Plus Food Digestion": "Align Bloating Relief + Food Digestion from Procter & Gamble Co. is a probiotic supplement designed to relieve occasional bloating, gas, and abdominal discomfort by adding healthy bacteria and vitamin B12 to support digestive balance and food digestion[1][4].",
  "Downy Amanecer": "Downy Amanecer is a fabric softener from Procter & Gamble that provides a clean and fresh aroma, making clothes feel like they have been freshly bathed all day[2].",
  "Metamucil 4-In-1 Fiber": "Metamucil 4-In-1 Fiber from Procter & Gamble Co. is a plant-based psyllium fiber supplement that promotes digestive health, supports heart health by lowering cholesterol, maintains healthy blood sugar levels, and controls appetite.",
  "SK-II Pitera": "SK-II Pitera is a proprietary, naturally derived ingredient from yeast fermentation, rich in over 50 micro-nutrients, including antioxidants, vitamins, minerals, and amino acids, designed to improve skin texture and reduce visible signs of aging.",
  "Febreze Car": "Febreze Car from Procter & Gamble Co. is an innovative air freshener designed to eliminate odors and provide a fresh scent in vehicles, featuring customizable scent intensity and a modern, discreet design.",
  "Oral-B Cross Action": "Oral-B CrossAction from Procter & Gamble Co. is a manual toothbrush featuring angled bristles that flex and straighten to penetrate between teeth and along the gumline, effectively removing up to 99% of plaque in hard-to-reach areas.",
  "Old Spice": "Old Spice, a Procter & Gamble brand, offers a range of male grooming products including aftershaves, deodorants, antiperspirants, shampoos, body washes, shaving cream, and soaps, known for its distinctive nautical theme and classic scents.",
  "Oral-B Encias Detox": "Oral-B Encias Detox is a toothpaste from Procter & Gamble Co. that eliminates bacteria in hard-to-reach areas, promoting healthier gums and a refreshing sensation after brushing[1][4].",
  "Olay Super Eyes": "Olay Super Eyes Daily Eye Serum is a 5-in-1 eye serum from Procter & Gamble Co., offering benefits like instant brightening, cooling, and hydration, with key ingredients like Vitamin C, Niacinamide, and Amino Peptides to refresh and firm the skin around the eyes[1][4].",
  "Ivory": "Ivory is an American flagship personal care brand from Procter & Gamble, known for its pure and gentle white bar soap that floats on water, with a history dating back to 1879[1][4][5].",
  "Swiffer Powermop": "The Swiffer PowerMop from Procter & Gamble Co. is an all-in-one, battery-powered spray mop that offers a convenient and effective cleaning solution for various hard floor surfaces, featuring multi-surface mopping pads with 300+ scrubbing strips and a fresh scent solution[1][2][3].",
  "Downy Soft": "Downy Soft from Procter & Gamble Co. is a fabric softener that infuses fabrics with silky softness, reduces wrinkles, and fights static cling, providing long-lasting freshness and protection to clothes[4][5].",
  "Dayquil Severe": "DayQuil Severe from Procter & Gamble Co. is a maximum strength, non-drowsy daytime cold and flu relief medication that temporarily relieves 9 symptoms including coughing, stuffy nose, minor body pain, chest congestion, sinus congestion, sinus pressure, sore throat, headache, and fever[1].",
  "Secret Fresh Defense": "Secret Fresh Defense from Procter & Gamble Co. offers 72-hour breathable sweat and odor protection, ensuring long-lasting freshness and confidence throughout the day[1][2].",
  "Tide Ultra": "Tide Ultra from Procter & Gamble Co. is a high-performance laundry detergent known for its powerful stain-fighting capabilities, built-in pre-treaters, and effectiveness in both high-efficiency and standard washing machines[1][3].",
  "Naturella": "Naturella is a brand of feminine hygiene products, owned by Procter & Gamble, known for its use of chamomile extract in pads and tampons that provide comfort and hypoallergenic protection for women.",
  "Gillette ProGlide": "Gillette ProGlide is a high-performance men's razor from Procter & Gamble Co., featuring five antifriction blades, microfins for skin smoothing, an enhanced lubrastrip for comfort, FlexBall technology for contour adaptation, and a precision trimmer for styling and hard-to-reach areas[1][3][5].",
  "Art Of Shaving": "The Art of Shaving, a high-end men's grooming brand acquired by Procter & Gamble Co. in 2009, offers luxury shaving and skin care products known for their natural ingredients and clinical testing for sensitive skin.",
  "Olay Corporate": "Olay is a leading American skin care brand owned by Procter & Gamble, offering a wide range of products designed to address various skin concerns through result-driven science and superior formulations[1][4].",
  "Native Candy Shop": "Native Candy Shop is a line of candy-inspired, sweetly scented personal care products from Procter & Gamble Co., featuring deodorants, body washes, shampoos, and conditioners with fragrances like Gummy Bear and Strawberry & Vanilla[3][4].",
  "Always Infinity": "Always Infinity from Procter & Gamble Co. is a revolutionary feminine care product featuring FlexFoam material that absorbs 10 times its weight, providing unparalleled comfort and protection with a unique, form-fitting design[2][5].",
  "Olay Ultra Moisture": "Olay Ultra Moisture from Procter & Gamble Co. is a line of body washes and moisturizers that provide long-lasting hydration and visibly transform skin with its advanced formulas, backed by 60 years of skin science[1][4].",
  "Gain Fireworks": "Gain Fireworks from Procter & Gamble Co. is an in-wash scent booster that adds a crisp, outdoorsy fragrance to laundry, lasting longer than regular detergent alone[2].",
  "Sinex Severe": "Sinex Severe from Procter & Gamble Co. is a fast-acting nasal spray decongestant that temporarily relieves nasal congestion and sinus pressure due to colds, hay fever, or upper respiratory allergies.",
  "Gillette Labs": "Gillette Labs is a premium sub-brand from Procter & Gamble Co., known for innovative shaving products like the exfoliating razor, which combines shaving and exfoliation in one stroke, offering a close and comfortable shaving experience[1][2][4].",
  "Head & Shoulders Clinical Strength": "Head & Shoulders Clinical Strength is a line of extra-strength shampoos from Procter & Gamble Co., designed to provide fast, powerful relief from severe dandruff, dryness, and itchiness, using ingredients like 1% selenium sulfide and manuka honey[1][2][4].",
  "Bounce": "Bounce, a brand owned by Procter & Gamble, specializes in fabric care products like dryer sheets that reduce static cling, fight wrinkles, and soften fabrics, offering long-lasting freshness and convenience in laundry care.",
  "Herbal Essences": "Herbal Essences is a brand of hair care products by Procter & Gamble, known for its natural ingredients, sulfate-free formulations, and commitment to sustainability and cruelty-free practices.",
  "Downy Light": "Downy Light Scent Booster Beads from Procter & Gamble Co. are small, lightly scented laundry beads that provide 4x longer-lasting freshness without heavy perfumes, dyes, or phosphates, making them safe for all colors and fabrics[1][2][4].",
  "Always Radiant": "Always Radiant from Procter & Gamble Co. offers a range of menstrual pads featuring FlexFoam technology for 100% leak and odor-free protection, designed to provide comfort and style with various absorbency levels and trendy designs[1][3][4].",
  "Charmin": "Charmin is a leading American brand of toilet paper, established in 1928 and owned by Procter & Gamble, known for its softness and innovative products like Charmin To Go for away-from-home use[1][3][5].",
  "Charmin Extra Strong": "Charmin Ultra Strong from Procter & Gamble Co. is a 2-ply toilet paper known for its diamond weave texture, 4X strength when wet, and clog-safe and septic-safe properties, providing a long-lasting and confident clean[1][4].",
  "Olay Indulgent Moisture": "Olay Indulgent Moisture Body Wash, from Procter & Gamble Co., is a luxurious, 24-hour moisturizing body wash infused with Vitamin B3 and various fragrances, designed to provide hydrating and nourishing benefits for visibly glowing skin[1][2][3].",
  "Pampers Swaddlers": "Pampers Swaddlers from Procter & Gamble Co. are designed with advanced leak protection, breathable layers, and ultra-absorbent cores to keep babies' skin dry and comfortable, featuring sizes up to 8 for larger babies[1][3].",
  "Dayquil": "DayQuil from Procter & Gamble Co. is a non-drowsy, daytime cold and flu medicine that provides powerful relief for symptoms such as cough, nasal congestion, sore throat, headache, and fever.",
  "Nervive": "Nervive, a line of supplements and topical creams from Procter & Gamble Co., is designed to address nerve care and pain relief, leveraging ingredients like Alpha Lipoic Acid and B vitamins to support nerve health and alleviate occasional nerve aches and discomfort[1][2][5].",
  "Neurobion": "Neurobion, a brand from Procter & Gamble Co., offers a combination of vitamins B1, B6, and B12 to help protect and nourish nerves, prevent deficiencies, and support overall nerve health.",
  "Head & Shoulders BARE": "Head & Shoulders BARE is a line of sulfate-free, silicone-free, and dye-free anti-dandruff shampoos from Procter & Gamble Co., featuring a minimalist ingredient approach and sustainable packaging with 45% less plastic per mL[1][2][4].",
  "Dawn Power": "Dawn Power from Procter & Gamble Co. is a line of dish cleaning products known for their superior grease-cutting capabilities, innovative formulas, and eco-friendly ingredients, designed to make washing dishes faster and more efficient[1][2][5].",
  "Swiffer Sweeper": "The Swiffer Sweeper from Procter & Gamble Co. is a 2-in-1 hard surface floor cleaner that combines sweeping and mopping capabilities with fluffy 3D fibers to trap and lock dirt, dust, and hair, and absorb tough messes with heavy-duty dry and wet cloths[1][2][4].",
  "Dodot": "Dodot, a brand from Procter & Gamble, offers a range of baby care products including nappies and wipes, known for their quality and comfort[3][5].",
  "Vicks VapoPatch": "Vicks VapoPatch is a non-medicated, wearable aroma patch from Procter & Gamble Co. that provides soothing Vicks vapors through a blend of eucalyptus and essential oils, menthol, and camphor, lasting up to 8 hours[1][4].",
  "Old Spice Swagger": "Old Spice Swagger is a line of male grooming products, including body sprays and deodorants, known for their fresh scents and long-lasting odor protection, manufactured by Procter & Gamble Co. [1][2][4]",
  "Downy Ultra": "Downy Ultra from Procter & Gamble Co. is a fabric conditioner that provides 7 benefits, including lasting freshness, color protection, softness, stretch fighter, wrinkle reduction, anti-static, and anti-fuzz, leaving clothes feeling softer, smelling fresher, and looking newer[1][4].",
  "Nervive Nerve Relief": "Nervive Nerve Relief from Procter & Gamble Co. is a dietary supplement designed to help alleviate occasional nerve aches, discomfort, and weakness due to aging, using a blend of Alpha Lipoic Acid, B Complex Vitamins, and herbal extracts like Turmeric and Ginger[1][2][5].",
  "Gillette Venus": "Gillette Venus, a line from Procter & Gamble Co., offers a range of razors and shaving products designed for women, featuring multiple blades, moisture strips, and ergonomic handles for a smooth and comfortable shaving experience[1][4].",
  "SK-II": "SK-II, a premium skincare brand owned by Procter & Gamble, is renowned for its Pitera-based products, which are designed to enhance skin health and appearance through a proprietary yeast extract derived from sake fermentation[1][2][5].",
  "Secret": "Secret is an antiperspirant/deodorant brand for women by Procter & Gamble, offering a range of products with innovative formulas for superior odor and wetness protection[1][3].",
  "Swiffer": "Swiffer is a brand of cleaning products from Procter & Gamble, known for its innovative, easy-to-use mops and dusters that simplify home cleaning with disposable refills and pads[1][3][5].",
  "OUAI": "OUAI, a prestige haircare brand founded by celebrity hairstylist Jen Atkin, offers cruelty-free, paraben-free products known for their high-end quality and chic packaging, now part of Procter & Gamble Co.",
  "Febreze Extra Strength": "Febreze Extra Strength is a powerful fabric refresher from Procter & Gamble Co., designed to eliminate tough odors in household fabrics with a long-lasting, sparkling fresh scent.",
  "Nativa": "Native, a Procter & Gamble Co. brand, offers clean and simple personal care products, including deodorants, hair care, and body wash, using naturally derived ingredients and a subscription model, targeting health-conscious consumers with a focus on sustainability and cruelty-free practices[1][2][4].",
  "Vicks Vapo Freeze": "Vicks Vapo Freeze is a pain-relieving cream from Procter & Gamble Co., designed to provide fast and targeted relief for sore muscles, backaches, strains, bruises, sprains, and everyday joint pain.",
  "Head & Shoulders Itchy Scalp Care": "Head & Shoulders Itchy Scalp Care is a paraben-free, clinically proven anti-dandruff shampoo from Procter & Gamble Co., featuring eucalyptus scent and providing up to 100% dandruff protection.",
  "Downy April Fresh": "Downy April Fresh from Procter & Gamble Co. is a liquid fabric softener that provides long-lasting freshness and softness to clothes, reducing static cling and leaving a floral scent[1][2][4].",
  "Zzzquil": "ZzzQuil is a non-habit forming, over-the-counter (OTC) sleep aid from Procter & Gamble Co., containing diphenhydramine HCl to help reduce sleep onset time and improve sleep quality for occasional sleeplessness in adults and children over 12 years old[1][2].",
  "Align": "Align, a health and wellness brand owned by Procter & Gamble, offers a range of probiotic supplements designed to support gastrointestinal health and maintain digestive balance.",
  "Vicks Vaporub": "Vicks VapoRub is a mentholated topical ointment by Procter & Gamble, used to relieve coughs and minor muscle and joint pains, containing active ingredients like camphor, eucalyptus oil, and menthol[1][3][4].",
  "Pampers Club": "Pampers Club is a loyalty program by Procter & Gamble Co. that rewards parents with cash and discounts for scanning diaper and wipe codes, offering exclusive deals, parenting tips, and personalized diapering recommendations[1][2][4].",
  "Gillette Specialized": "Gillette, a brand of Procter & Gamble Co., specializes in personal care products including safety razors, shaving supplies, electric shavers, toothbrushes, and other grooming essentials.",
  "Downy Rinse & Refresh": "Downy Rinse & Refresh is a breakthrough laundry odor remover from Procter & Gamble Co., designed to dissolve and break down odor-causing residues, providing 3X odor-fighting power compared to detergent alone[1][3][4].",
  "Pantene Pro-V": "Pantene Pro-V is a line of hair care products from Procter & Gamble, known for its nourishing and hydrating formulas that promote healthy, strong, and beautiful hair.",
  "Olay Body": "Olay Body, a brand from Procter & Gamble Co., offers a range of skincare products, including body washes and lotions, designed to enhance skin health and appearance with scientifically-backed ingredients like niacinamide, collagen, and hyaluronic acid[1][2][5].",
  "Pepto Kids": "Pepto Kids, from Procter & Gamble Co., is an antacid chewable tablet designed to provide fast relief from heartburn, acid indigestion, sour stomach, and upset stomach for children, available in bubblegum flavor.",
  "Always Extra Heavy Overnight": "Always Extra Heavy Overnight Pads from Procter & Gamble Co. offer up to 10 hours of leak-free protection with a larger back design and advanced LeakGuard and RapidDRY technologies for superior nighttime comfort and security[1][2][4].",
  "Gillette Intimate": "Gillette Intimate is a line of pubic hair grooming products from Procter & Gamble Co., designed for men with features like waterproof trimmers, protective combs, and dermatologist-tested blades for gentle and easy intimate shaving.",
  "Febreze": "Febreze is an American brand of household odor eliminators manufactured by Procter & Gamble, offering a range of products that eliminate and neutralize unpleasant smells using patented technologies like OdorClear and hydroxypropyl beta-cyclodextrin (HPCD) [1].",
  "Gillette Fusion": "Gillette Fusion from Procter & Gamble Co. is a high-quality shaving system featuring advanced technology, including five-blade razors and skincare products, designed to provide a comfortable and close shave while addressing various grooming needs[1][4].",
  "Puffs Plus": "Puffs Plus from Procter & Gamble Co. offers 2-ply facial tissues with lotion containing shea butter, aloe, and vitamin E to provide soothing comfort and prevent irritation.",
  "Secret Sheer": "Secret Sheer from Procter & Gamble Co. is an invisible solid antiperspirant/deodorant offering long-lasting, reliable 24-hour sweat and odor protection with a pH-balanced formula that works with the body's natural chemistry, certified cruelty-free by PETA[2][4].",
  "Gillette Mach 3": "The Gillette Mach 3 from Procter & Gamble Co. is a high-performance razor system featuring stronger-than-steel blades, designed for a close, comfortable shave with up to 15 shaves per cartridge[1][3].",
  "Naturella Nocturna": "Naturella Nocturna by Procter & Gamble Co. is a line of sanitary pads designed for nighttime use, featuring 6 zones of protection to prevent leaks and maintain skin hygiene throughout the night[3][5].",
  "Olay Cleansing Melts": "Olay Cleansing Melts are water-activated facial cleansers that transform into a rich, creamy microbubble lather, providing a gentle yet effective clean for all skin types, including sensitive skin, and are available in various formulations such as Vitamin C, Retinol, and Hyaluronic Acid[1][2][3].",
  "Olay Cleansing & Renewing": "Olay Cleansing & Renewing from Procter & Gamble Co. is a line of body washes that combines powerful ingredients like retinol and Vitamin B3 to deeply nourish and rejuvenate the skin, promoting cell turnover and reducing the appearance of fine lines and uneven skin tone[2][3][5].",
  "Gillette SkinGuard": "Gillette SkinGuard is a razor designed for men with sensitive skin, featuring patented \"guard\" technology that cuts hair at skin level, minimizing irritation and tug, and providing a comfortable shaving experience[1][3][4].",
  "Bounce Pet Hair & Lint Guard": "Bounce Pet Hair & Lint Guard from Procter & Gamble Co. are extra-large dryer sheets designed to effectively remove pet hair and reduce lint, while also controlling static and leaving a fresh scent[1][2][4].",
  "Align Probiotic": "Align Probiotic from Procter & Gamble Co. is a daily probiotic supplement containing the patented Bifidobacterium 35624 strain, designed to support digestive health and maintain gut balance.",
  "Charmin Ultra": "Charmin Ultra from Procter & Gamble Co. is a premium toilet paper brand offering both Ultra Soft and Ultra Strong options, known for their exceptional softness and strength, respectively, with innovative features like wavy perforation for a smoother tear[1][2][4].",
  "Secret Whole Body": "Secret Whole Body Deodorant from Procter & Gamble Co. is an aluminum-free, clinically proven 72-hour odor protection product designed for use on the entire body, available in various forms including sticks, creams, and sprays, and partnered with ThirdLove for inclusive sizing and comfort.",
  "Vicks VapoCool": "Vicks VapoCool from Procter & Gamble Co. is a line of medicated drops and lozenges that provide fast and maximum-strength relief for sore throats, featuring active ingredients like menthol and benzocaine, and are available in various flavors such as honey lemon chill[1][2][4].",
  "Tampax Radiant": "Tampax Radiant tampons from Procter & Gamble Co. offer up to 100% leak-free protection with a LeakGuard Braid, Textured Grip, and BPA-free applicator, designed for comfort and hygiene during menstruation[1][3][4].",
  "Gain Flings": "Gain Flings from Procter & Gamble Co. are single-use laundry pacs offering 3-in-1 benefits with Gain detergent, OxiBoost, and Febreze freshness, delivering 50% more scent than regular Gain liquid detergent[1][2][3].",
  "Dreft": "Dreft is a hypoallergenic laundry detergent brand from Procter & Gamble, specifically designed for baby clothes and known for its gentle, stain-fighting formula recommended by pediatricians and dermatologists[1][2][3].",
  "Downy": "Downy, a brand from Procter & Gamble Co., offers a line of advanced fabric care products that help keep clothes soft and smelling fresh, including fabric softeners, dryer sheets, and in-wash scent boosters[3].",
  "Metamucil Fiber Plus Vitamins": "Metamucil Fiber Plus Vitamins from Procter & Gamble Co. are gummies that combine plant-based fiber with vitamins C, D, and B12 to support digestive health and immune function.",
  "Braun Series 9": "The Braun Series 9 from Procter & Gamble Co. is a high-end electric shaver featuring advanced technology, including a 4-blade cutting system, Sonic Technology, and AutoSense, designed for efficient and comfortable shaving with up to 60 minutes of cordless use[1][2][5].",
  "Safeguard": "Safeguard from Procter & Gamble Co. is a line of antibacterial soaps designed to effectively remove bacteria and germs, promoting hand hygiene and cleanliness.",
  "Always Overnight": "Always Overnight Pads from Procter & Gamble Co. are designed to provide maximum protection against leakage during the night, featuring advanced materials and technologies for a comfortable and worry-free sleep[1].",
  "Olay Hyaluronic Acid": "Olay Hyaluronic Acid from Procter & Gamble Co. is a powerful hydrator that attracts and binds water molecules, providing long-lasting hydration, reducing fine lines and wrinkles, and maintaining a plump, supple skin appearance.",
  "NyQuil High Blood Pressure": "NyQuil High Blood Pressure from Procter & Gamble Co. is a sugar-free, alcohol-free, and decongestant-free liquid medicine that provides fast, powerful relief for common cold and flu symptoms, specifically designed for individuals with high blood pressure[1][4].",
  "Swiffer Heavy Duty": "Swiffer Heavy Duty from Procter & Gamble Co. offers 360-degree coated fibers that trap and lock up to 3x more dust and allergens, making it ideal for hard-to-reach areas and pet hair removal[1][2][4].",
  "Vicks VapoStick": "Vicks VapoStick is a non-medicated, easy-to-use solid balm from Procter & Gamble Co., providing soothing Vicks vapors with a no-touch application, suitable for adults and children ages 4 and up[1][4].",
  "ZzzQuil Nighttime Sleep": "ZzzQuil Nighttime Sleep from Procter & Gamble Co. is a non-habit-forming sleep aid containing diphenhydramine HCI, designed to help individuals fall asleep quickly and wake up refreshed, available in various forms including liquid and capsules[1][2][4].",
  "ZzzQuil Ultra": "ZzzQuil Ultra, from Procter & Gamble Co., is a nighttime sleep aid tablet containing 25 mg of doxylamine succinate, clinically proven to help users fall asleep faster and stay asleep longer, while being non-habit forming[1][2][4].",
  "Mielle Organics Pomegranate & Honey": "Mielle Organics Pomegranate & Honey is a line of natural hair care products by Mielle Organics, not directly affiliated with Procter & Gamble Co., but known for its moisturizing and detangling formulas featuring pomegranate extract and honey, specifically designed for thick, curly hair types.",
  "Pampers Baby-Dry": "Pampers Baby-Dry from Procter & Gamble Co. offers up to 100% leakproof nights and features three absorbent layers, a Dri-Weave Liner, and a Wetness Indicator for superior overnight protection and comfort[1][2][4].",
  "Fixodent": "Fixodent, from Procter & Gamble Co., is the #1 dentist-recommended denture adhesive brand, providing long-lasting retention and comfort for both full and partial denture wearers[2][3][5].",
  "DayQuil Kids": "DayQuil Kids from Procter & Gamble Co. is a cold and flu medication specifically designed for children aged 6 and up, providing fast relief from cough, fever, and congestion with a kid-friendly honey flavor[1][4].",
  "Lenor": "Lenor is a fabric conditioner brand from Procter & Gamble Co., known for its ability to soften and freshen laundry, with a range of products including fabric enhancers and liquid detergents[1][2][5].",
  "Tide Washing Machine Cleaner": "Tide Washing Machine Cleaner from Procter & Gamble Co. is a powder designed to remove odor-causing residues and deposits from washing machines, using its oxygenated formula with Oxi and TAED to keep machines clean and fresh."
}