{
    "Febreze Car": "Febreze produces a variety of car air fresheners including clips and sprays designed to eliminate odors and provide long-lasting freshness.",
    "Swiffer Dry": "Swiffer Dry is a brand of cleaning products designed for both sweeping and mopping hard surfaces, featuring heavy duty cloths with deep textured fibers that trap and lock dirt, dust, and hair.",
    "Swiffer Dry & Wet": "Swiffer is a cleaning tool brand that offers both dry and wet sweeping and mopping solutions for home use.",
    "Swiffer Duster": "Swiffer Dusters are designed to trap and lock dust and allergens with specially coated fibers for efficient cleaning of tight spaces and surfaces.",
    "Swiffer Heavy Duty": "Swiffer Heavy Duty is a product line by Procter & Gamble introduced in 1999, offering various cleaning solutions for pets and hard floor surfaces.",
    "Swiffer Powermop": "Swiffer PowerMop is an all-in-one mopping system that provides a mop and bucket clean in half the time with multi-surface mopping pads featuring over 300 scrubbing strips for deep cleaning.",
    "Swiffer Sweeper": "Swiffer is a cleaning brand known for products like mops and kits designed to easily clean surfaces without scratching, particularly useful for tackling pet hair and tough messes.",
    "Swiffer Wet": "Swiffer WetJet is an all-in-one mopping system designed for cleaning various floor types with a powerful clean that breaks up and dissolves tough messes.",
    "Swiffer WetJet": "Swiffer WetJet is an all-in-one mopping system that breaks up and dissolves tough messes for a powerful clean.",
    "Swiffer": "Swiffer is an American brand of cleaning products owned by Procter & Gamble, known for its innovative floor mopping systems and sweeper products.",
    "Braun": "Braun was founded in 1839 and is currently owned by the Braun family through B. Braun Melsungen SE, but it is also part of Procter & Gamble.",
    "Zevo": "ZEVO India is a company focused on electric mobility and sustainable logistics, offering electric vehicle supply chain solutions and services for first-mile, mid-mile, and last-mile delivery.",
    "Mr Clean": "Mr Clean is a brand name and mascot owned by Procter & Gamble, known for its powerful cleaning products including the Mr Clean Magic Eraser.",
    "Mr Clean Magic Eraser": "Mr Clean Magic Eraser is an all-purpose cleaning pad owned by Procter & Gamble Company and used for cleaning various surfaces around the house.",
    "Mr Clean Magic Toilet": "Mr Clean is a company that offers various cleaning products including foaming toilet cleaners and magic eraser scrubbers designed for tough stains.",
    "Procter & Gamble": "Procter & Gamble (P&G) is an American multinational consumer goods corporation headquartered in Cincinnati, Ohio, founded in 1837, known for its diverse line of branded products and commitment to social responsibility.",
    "Cascade": "Cascade is a British DJ duo and also refers to a waterfall or series of waterfalls, with some references to a company involved in strategy software and another in forklift parts.",
    "Dawn": "Dawn is a Pakistani English-language newspaper that was launched by Muhammad Ali Jinnah in 1941 and is part of the Dawn Media Group owned by the Amber Haroon family.",
    "Dawn Power": "Dawn Powerwash is a company registered in India on 09-01-2012 with the Corporate Identification Number U40300TG2012PTC078460.",
    "Dawn Ultra": "Dawn Ultra is a highly concentrated dishwashing liquid owned by Procter & Gamble, known for its powerful cleaning ability against grease and grime.",
    "Cascade Platinum": "Cascade Platinum is a brand of dishwasher detergent and rinse aid owned by Procter & Gamble.",
    "Dawn Platinum": "Dawn Platinum is a product line of Procter & Gamble known for its effective cleaning properties on grease and food residue.",
    "Gain": "The Global Alliance for Improved Nutrition (GAIN) is a Swiss-based foundation with a mission to improve nutrition outcomes by enhancing the consumption of nutritious and safe food, especially among vulnerable populations.",
    "Downy": "Downy is an American brand of fabric softener produced by Procter & Gamble, introduced in 1960 and a subsidiary of one of the world's leading consumer packaged goods companies.",
    "Bounce": "Bounce is a company with multiple business ventures including trampoline parks, luggage storage services, and electric scooters.",
    "Bounce Dryer Bar": "Bounce Dryer Bar is a fabric softener that comes in bars and holders designed for use in dryers, with some users reporting issues with durability and others praising its effectiveness in softening clothes and providing a fresh scent.",
    "Bounce Free & Gentle": "Bounce Free & Gentle dryer sheets are dermatologist-tested and hypoallergenic, free of perfumes, designed for sensitive skin, and effective at reducing static, fighting wrinkles, and softening clothes.",
    "Bounce Pet Hair & Lint Guard": "Bounce Pet Hair and Lint Guard Mega Dryer Sheets repel pet hair from clothes before it sticks and reduce static, wrinkles, and lint.",
    "Downy Amanecer": "Downy Amanecer is a fabric softener product line by Downy that provides clean and fresh aromas for clothes.",
    "Downy April Fresh": "Downy April Fresh is a brand of fabric conditioner produced by Procter & Gamble.",
    "Downy Comfy Cozy": "Downy Comfy Cozy is a line of laundry scent boosters and fabric softeners by The Procter & Gamble Company, known for their toasted vanilla and seaside spa scents.",
    "Downy Rinse & Refresh": "Downy Rinse & Refresh is a laundry odor remover and fabric softener from Procter & Gamble that helps rinse away smelly residue and simplify the laundry process.",
    "Downy Soft": "Downy is an American fabric softener brand owned by Procter & Gamble, introduced in 1960 and widely used for its softness and freshness in laundry.",
    "Downy Ultra": "Downy is a brand owned by Procter & Gamble that provides fabric softener and other laundry care products.",
    "Lenor": "Lenor is a laundry scent brand owned by Procter & Gamble and introduced in 1960.",
    "Tide Stain Release": "Tide Stain Release is a laundry detergent brand owned by Procter & Gamble that offers products for stain removal and fresh cleaning.",
    "Tide To Go": "Tide To Go is a line of instant stain removers designed by Procter & Gamble and available in various formats such as pens and mini bottles.",
    "Gain Fireworks": "Gain Fireworks is a brand of laundry scent booster beads that provide up to 12 weeks of freshness for your laundry and works with various detergents.",
    "Tide": "Tide is a financial service company that offers current accounts for small and medium-sized enterprises, founded in 2015 and currently operating in three markets with over 875,000 business owners globally.",
    "Ariel": "Ariel is a British brand of laundry detergent owned by Procter & Gamble and developed by the European Technology Centre in Belgium.",
    "Ariel Color De Luxe": "Ariel Color De Luxe is a brand that produces laundry detergent.",
    "Ariel Ultra": "Ariel Ultra is a brand of laundry detergent and stain remover owned by Procter & Gamble.",
    "Gain Flings": "Gain Flings is a brand of laundry detergent pac provided by Procter & Gamble.",
    "Ivory Snow": "Ivory Snow is a personal care brand created by Procter & Gamble that offers baby laundry detergents and other household products.",
    "Tide Evo": "Tide evo is a revolutionary new tile form of laundry detergent introduced by Procter & Gamble, offering concentrated cleaning with recyclable packaging and eliminating plastic bottles.",
    "Tide Pods": "Tide Pods are a line of laundry detergent pods from Procter & Gamble under the Tide brand, introduced in 2012.",
    "Tide Power Pods": "Tide Power Pods are liquid laundry detergent pods designed for superior stain removal and deep cleaning of fabrics, produced by Procter & Gamble.",
    "Tide Ultra": "Tide Ultra is a laundry product line owned by Procter & Gamble that offers detergents for semi-automatic washing machines and hand-washing, known for their stain removal capabilities.",
    "Ariel Revita Color": "Ariel Revita Color is a liquid detergent specifically designed for colored and dark garments, aimed at maintaining color vibrancy with its concentrated formula.",
    "Bold 3": "Not sure",
    "Dreft": "Dreft is a detergent brand launched in Belgium in 1948 and in the Netherlands in 1957, owned by Procter & Gamble.",
    "Gain Relax": "Not sure",
    "Tide Free & Gentle": "Tide Free & Gentle is a powerful, hypoallergenic laundry detergent that is free of dyes and perfumes, designed for effective stain removal while being gentle on sensitive skin.",
    "Ariel Doble Poder": "Ariel Doble Poder is a laundry detergent brand known for its dual cleaning power and effectiveness on tough stains, available in various pack sizes.",
    "ILoveGain.com": "ILoveGain.com is owned by The Procter & Gamble Company and is associated with Gain laundry care products, including detergents, fabric softeners, and other homecare items.",
    "Downy Light": "Downy Light is a line of lightly scented laundry beads designed for all-day freshness without heavy perfumes, dyes, or phosphates.",
    "Downy Unstopables": "Downy Unstopables is a scent booster product from Procter & Gamble that enhances the freshness of laundry for up to 12 weeks.",
    "Tide Washing Machine Cleaner": "Tide Washing Machine Cleaner is a product by Tide that removes residues and dirt from washing machines to keep them clean for better laundry results.",
    "Charmin": "Charmin is an American brand of toilet paper owned by Procter & Gamble since 1957.",
    "Charmin Extra Strong": "Charmin is a brand of ultra strong toilet paper produced by Procter & Gamble (P&G).",
    "Charmin Super Mega Roll": "Charmin Super Mega Roll is a type of ultra-strong toilet paper known for its softness and long-lasting nature.",
    "Charmin Ultra": "Charmin Ultra is a brand of ultra-soft toilet paper produced by Procter & Gamble, known for its absorbency and softness.",
    "Puffs": "Puffs is known for its facial tissues and has a history dating back to when Procter & Gamble introduced it in 1958 with lovable characters called Puffs Pals.",
    "Puffs Plus": "Puffs Plus offers lotion facial tissues designed for comfort and moisture locking, suitable for allergy relief and nasal issues.",
    "Bounty": "Bountyproducts is an owner-based company located in Rohru, Shimla, Himachal Pradesh, India, which provides reviews and buying guides.",
    "Febreze": "Febreze is an American brand of household odor eliminators manufactured by Procter & Gamble and sold globally.",
    "Febreze Air Effects": "Febreze Air Effects is an air freshener brand known for its ability to clean and eliminate odors with a long-lasting fresh scent.",
    "Febreze Air Mist": "Febreze Air Mist is a line of instant odor-fighting room freshener sprays produced by Procter & Gamble.",
    "Febreze Fade Defy": "Febreze Fade Defy PLUG is an air freshener designed to eliminate household odors with a first-day freshness lasting up to 50 days on low settings, featuring continuous odor elimination and scented oil refills.",
    "Febreze Plug": "Febreze PLUG is a scent booster air freshener product owned by Procter & Gamble and introduced in March 1996.",
    "Febreze Small Spaces": "Febreze Small Spaces offers air fresheners designed to eliminate odors effectively and last up to 45 days in small spaces.",
    "Febreze Extra Strength": "Febreze Extra Strength is an odor-eliminating fabric refresher that provides effective and long-lasting freshness for hard-to-wash fabrics around the home.",
    "Zevo Max": "Zevo Max is a flying insect trap that uses blue and UV light to attract and capture insects such as house flies, fruit flies, gnats, and mosquitoes.",
    "Zevo Trap": "Zevo Trap is a line of insect control products developed by Procter & Gamble that use UV light and Trap + Lock technology to catch flying insects without odors or messes.",
    "DentureLiving.com": "DentureLiving.com is a company that provides information and products related to dentures and denture adhesives, including tips for denture wearers and contact information.",
    "Vicks": "Vicks is an American brand of over-the-counter medications owned by Procter & Gamble and Kaz Incorporated, known for its cough, cold, flu, and allergy relief products.",
    "Art Of Shaving Shop": "The Art of Shaving is a United States retail business founded in 1996 by Eric Malka and Myriam Zaoui, offering high-end men's shaving and skin care accessories.",
    "Procter & Gamble Corporate": "Procter & Gamble is an American multinational consumer goods corporation headquartered in Cincinnati, Ohio.",
    "Procter & Gamble Co": "Procter & Gamble is an American multinational consumer goods corporation headquartered in Cincinnati, Ohio, founded over 185 years ago and known for its diverse range of branded products.",
    "Dayquil": "DayQuil is a line of over-the-counter medications produced by Procter & Gamble for the relief of common cold and flu symptoms such as headache, fever, cough, and nasal congestion.",
    "DayQuil High Blood Pressure": "DayQuil High Blood Pressure is an over-the-counter liquid medicine designed to relieve cold and flu symptoms such as headache, fever, minor aches and pains, sore throat, and cough for individuals with high blood pressure.",
    "Dayquil Severe": "DayQuil SEVERE is a product line by Procter & Gamble that provides relief for symptoms of cold, flu, and related conditions such as headache, fever, body aches, cough, chest congestion, sinus pressure, and nasal congestion.",
    "NyQuil High Blood Pressure": "NyQuil High Blood Pressure is a nighttime cold and flu relief liquid specifically formulated for people with high blood pressure, providing temporary relief from symptoms such as headache, fever, sore throat, minor aches and pains, sneezing, runny nose, and cough.",
    "Nyquil Severe": "NyQuil SEVERE is a brand of over-the-counter medication manufactured by Procter & Gamble for treating symptoms of the common cold, flu, and congestion.",
    "NyQuil Severe Vapocool": "NyQuil Severe VapoCOOL is a product line owned by The Procter & Gamble Company that provides relief for multiple cold and flu symptoms.",
    "Sinex": "SINEX SYSTEMS PRIVATE LIMITED is a private company incorporated on December 19, 1995, with its registered office in Chennai, Tamil Nadu.",
    "Vicks Act 7": "VICK ACT 7 is an all-in-one solution for cold and flu symptoms provided by Vicks.",
    "Vicks Pyrena": "Vick Pyrena is a brand owned by Juan Manuel Montes González in Bogotá, Colombia and also associated with Luis Madruga Enriquez in Mexico.",
    "Sinex Severe": "Sinex Severe Nasal Spray is a product line by Vicks aimed at relieving sinus and nasal congestion due to colds, hay fever, or upper respiratory allergies.",
    "DayQuil Kids": "DayQuil Kids is a brand of children's cold and cough medicine formulated with real honey for relief from symptoms such as nasal congestion, sinus pressure, cough, and mucus, suitable for children aged 6 and older.",
    "Vicks Childrens Sinex": "Vicks Sinex is a brand of children's nasal saline mist and decongestant nasal spray designed for relieving stuffy noses caused by colds, allergies, or other respiratory issues.",
    "Vicks VapoPatch": "Vicks VapoPatch is an easy-to-use aromatherapy patch that provides soothing non-medicated Vicks vapors for relief from cold and cough symptoms.",
    "Vicks Vaporub": "Vicks VapoRub is a topical medicine containing menthol, camphor, and eucalyptus oil that provides relief from coughs, cold symptoms, and minor aches and pains.",
    "Vicks VapoStick": "Vicks VapoStick is an easy-to-use solid stick that goes on clear and dries quickly, providing a no-touch application for soothing relief.",
    "Zzzquil": "ZzzQuil is a sleep aid brand owned by P&G Health, known for offering non-habit-forming sleep supplements like gummies and liquids containing melatonin or diphenhydramine.",
    "ZzzQuil Ultra": "ZzzQuil Ultra is a nighttime sleep aid tablet containing Doxylamine Succinate 25mg, clinically proven to help you sleep longer and wake up refreshed.",
    "Vicks VapoCool": "Vicks VapoCool is a brand of cold and flu symptom relief medicines including drops, sprays, and lozenges designed to soothe sore throats and provide cough relief.",
    "Pepto-Bismol": "Pepto-Bismol is an over-the-counter medication containing bismuth subsalicylate used to treat gastrointestinal issues such as heartburn, indigestion, diarrhea, and nausea.",
    "Pepto-Bismol Fast Melts": "Pepto-Bismol Fast Melts is a product line by Procter & Gamble offering fast and effective relief from nausea, heartburn, indigestion, and upset stomach through soft chewable tablets.",
    "Align": "Align is a company that provides technology infrastructure solutions and strategic growth management software, with a focus on managed IT services, cybersecurity, and data center solutions. It also refers to the alignment of objects or people in agreement.",
    "Align Yogurt Coated Probiotic Fruit Bites": "Align Yogurt Coated Probiotic Fruit Bites are a delicious way to add probiotics to your gut every day to help support digestive health.",
    "Pepto Kids": "Pepto Kids Chewable Tablets are a children's antacid product made by The Procter & Gamble Company for treating upset tummies, heartburn, sour stomach, and acid indigestion.",
    "Prilosec OTC": "Prilosec OTC is an over-the-counter medication used for frequent heartburn relief, providing long-lasting protection by reducing stomach acid production.",
    "Metamucil": "Metamucil is a fiber supplement brand that offers solutions for digestive health, cholesterol management, blood sugar control, and appetite control, originally introduced by G.D. Searle & Company (now G.D. Searle, LLC) in 1934 and acquired by Procter & Gamble in 1985.",
    "Metamucil 4-In-1 Fiber": "Metamucil is a brand of fiber supplement powder primarily made with psyllium fiber, designed for digestive health and appetite control, available in various flavors and forms.",
    "Metamucil Fiber": "Metamucil is a fiber supplement brand owned by Procter & Gamble that offers products for digestive health, cholesterol management, blood sugar control, and appetite control.",
    "Metamucil Fiber Plus Vitamins": "Metamucil Fiber Plus Vitamins Gummies are citrus berry flavored supplements containing plant-based fiber and vitamins C, D, and B12 with no added sugar.",
    "Metamucil Psyllium Fiber": "Metamucil is a brand of fiber supplements containing psyllium husk, manufactured by Procter & Gamble, used for digestive health, cholesterol management, blood sugar control, and appetite suppression.",
    "Dodot": "Dodot is a store and brand that sells designed dots clothing and offers related products such as diapers and baby care items.",
    "Vicks BabyBalm": "Vicks BabyBalm is a moisturizing balm designed for babies aged 6 months and older, containing soothing ingredients like coconut oil and aloe vera to protect and relax baby's skin.",
    "Dolo-Neurobion": "Dolo-Neurobion is a medication that provides pain relief and fever reduction, containing paracetamol and vitamin B-complex, and is owned by the founding family of Merck, with a majority stake.",
    "Nervive": "Not sure",
    "Vicks Vapo Freeze": "Vicks VapoFreeze is a topical pain relief spray designed to temporarily relieve minor aches and pains associated with arthritis, backache, strains, sprains, and bruises.",
    "NyQuil Z": "NyQuil ZzzQuil is a brand of over-the-counter medication manufactured by Procter & Gamble that offers products for nighttime symptom relief and sleep aid.",
    "Vicks Pure Zzzs": "Vicks Pure Zzzs is a line of sleep aid gummies containing melatonin and other natural ingredients designed to help you fall asleep naturally and get a full night's rest.",
    "Zzzquil Night Pain": "ZzzQuil Night Pain is a non-habit-forming sleep aid available in liquid and gel tab forms that also alleviates minor aches and pains.",
    "ZzzQuil Nighttime Sleep": "ZzzQuil is a sleep aid brand owned by The Procter & Gamble Company that offers various non-habit-forming sleep products including capsules and liquids containing Diphenhydramine HCI, as well as melatonin gummies.",
    "Zzzquil Pure Zzzs": "ZzzQuil PURE Zzzs is a line of sleep aid gummies containing melatonin and other soothing herbal ingredients, owned by Procter & Gamble.",
    "New Chapter": "New Chapter is a Vermont-based vitamin and supplement company that crafts natural products using organic ingredients to nourish body, mind, and soul.",
    "Align Bloating Relief Plus Food Digestion": "Align Bloating Relief + Food Digestion is a probiotic supplement that adds healthy bacteria to help relieve occasional digestive upsets and includes vitamin B12.",
    "Align Probiotic": "Align Probiotic is a probiotic supplement brand known for its #1 doctor-recommended status and offering products like Align Probiotic Supplement for digestive support and bloating relief.",
    "Align Probiotic Digestive Support": "Align Probiotic Digestive Support is a probiotic supplement designed to naturally help with occasional digestive issues such as abdominal discomfort, gas, and bloating.",
    "Nervive Nerve Relief": "Nervive Nerve Relief helps with occasional nerve aches and discomfort due to aging and other factors, containing Alpha Lipoic Acid, vitamins B12, B6, and B1, turmeric, ginger, and melatonin.",
    "Neurobion": "Neurobion is a brand of vitamin B supplements owned by Merck, a company based in Darmstadt, Germany.",
    "New Chapter Bone Strength Take Care": "New Chapter Bone Strength Take Care is a plant-based calcium supplement that supports bone density and strength, containing magnesium, vitamin D3, and other nutrients.",
    "New Chapter Every Womans One Daily": "New Chapter's Every Woman™'s One Daily Multivitamin is a comprehensive supplement designed for women’s health needs, containing essential vitamins and minerals derived from whole-food sources.",
    "Voost": "Vöost is an Australian brand of effervescent supplements that was acquired by Procter & Gamble in 2021 and primarily offers vitamin and mineral tablets designed to boost energy and wellness.",
    "Olay Corporate": "Olay is an American skincare brand owned by Procter & Gamble, known for its anti-aging skin care products and a science-first approach to skincare since 1952.",
    "Old Spice": "Old Spice is a men's grooming brand owned by Procter & Gamble (P&G), which acquired it in 1990 and has managed its marketing since then.",
    "Secret": "Not sure",
    "Herbal Essences": "Herbal Essences is a brand of hair care products owned by Procter & Gamble.",
    "Native": "Native is a top recruitment company in India providing executive jobs and works across industries.",
    "Olay Body": "Olay is an American skincare brand founded by Graham Wulff in 1950 and later acquired by Procter & Gamble in 1985, focusing on various body washes and moisturizers.",
    "Olay Hyaluronic Acid": "Olay offers a range of skincare products containing hyaluronic acid for hydration and anti-aging benefits.",
    "Olay": "Olay is an American skincare brand originally created by Graham Wulff in South Africa and later acquired by Procter & Gamble in 1985.",
    "Olay Cleansing": "Olay Cleansing is a brand of skincare products owned by Procter & Gamble that offers cleansing melts and other facial cleansers designed for all skin types.",
    "Olay Cleansing Melts": "Olay Cleansing Melts are water-activated facial cleansers designed for all skin types and tones, providing a gentle clean with additional benefits like retinol and vitamin C.",
    "SK-II": "SK-II is a Japanese-based multinational cosmetics brand known for its luxury skincare products, including the exclusive ingredient PITERA™, which claims to promote youthful skin.",
    "Olay Niacinamide": "Olay is a skincare company known for its use of Niacinamide in products designed to improve skin clarity, even out tone, reduce dark spots, and provide hydration and anti-aging benefits.",
    "Olay Regenerist": "Olay Regenerist is an anti-aging skin care brand owned by Procter & Gamble, known for its moisturizers and creams that firm, lift, and smooth wrinkles.",
    "Olay Super Eyes": "Olay Super Eyes Daily Eye Serum is an eye cream that instantly brightens dark circles and refreshes tired eyes with vitamin C, caffeine, aloe vera, niacinamide, and amino peptide ingredients.",
    "Olay Super Serum": "Olay Super Serum is a skincare product that offers five benefits in one: improves texture, evenness, firmness, hydration, and smoothness.",
    "SK-II Pitera": "SK-II is a Japanese luxury skincare brand known for its Facial Treatment Essence, which contains PITERA™, a proprietary natural bio ingredient derived from yeast fermentation.",
    "Native Mineral": "Native Mineral Resources is an Australia-focused gold and base metals company with a portfolio of advanced projects in Queensland, owned 7.23% by private companies and 39.4% by individual insiders.",
    "Gillette": "Gillette is an American brand of safety razors and personal care products owned by Procter & Gamble.",
    "Gillette Venus": "Gillette Venus is a brand within Gillette focused on women's shaving products.",
    "OUAI": "OUAI is a beauty brand acquired by Procter & Gamble, founded by celebrity hair stylist Jen Atkin.",
    "Mielle Organics": "Mielle Organics is a natural hair care brand founded by Monique Rodriguez, a registered nurse and CEO, which was sold to Procter & Gamble.",
    "Head & Shoulders": "Head & Shoulders is an American anti-dandruff shampoo brand produced by Procter & Gamble.",
    "Head & Shoulders BARE": "Head & Shoulders BARE is a new anti-dandruff shampoo from Procter & Gamble, featuring minimal ingredients and no sulfates, silicones or dyes.",
    "Head & Shoulders Classic Clean": "Head & Shoulders Classic Clean is a dandruff shampoo designed for daily use that targets flakes and provides scalp protection while being gentle on hair.",
    "Head & Shoulders Clinical Strength": "Head & Shoulders Clinical Strength is a brand owned by Alessandra Divizia.",
    "Head & Shoulders Itchy Scalp Care": "Head & Shoulders Itchy Scalp Care is a dandruff shampoo designed to relieve symptoms such as flakes, itch, oil, and dryness on the scalp.",
    "Head & Shoulders Anti-Comezon": "Head & Shoulders is a line of shampoo products designed to treat dandruff and scalp irritations.",
    "Herbal Essences Bio Renew": "Herbal Essences is a hair care brand that uses bio:renew, a blend of natural ingredients sourced from plants and verified by the Royal Botanic Gardens, Kew, owned by Clairol under Procter & Gamble.",
    "Herbal Essences Color Nurture": "Herbal Essences Color Nurture is a line of sulfate-free hair care products that includes shampoo and conditioner formulated to provide soft hair and vibrant color lasting up to four weeks, owned by P&G.",
    "Herbal Essences Sulfate Free": "Herbal Essences is owned by Clairol and offers sulfate-free botanical shampoos and conditioners.",
    "Mielle Organics Pomegranate & Honey": "Mielle Organics is a natural and organic hair care brand founded by Monique Rodriguez that offers products like Pomegranate & Honey Collection for Type 4 hair.",
    "Native Hair": "Native Hair is a personal care company that offers all-natural and chemical-free hair care products, including shampoos, conditioners, and treatments, focusing on strengthening and nourishing hair.",
    "Old Spice Swagger": "Old Spice Swagger is a deodorant line for men offered by Procter & Gamble, known for its fade-resistant scent technology and long-lasting freshness.",
    "Pantene Oil Replacement": "Pantene Oil Replacement is a hair product, typically sold in 180ml quantities, designed for nourishing and strengthening hair by reducing fall and damage, suitable for all hair types.",
    "Pantene Pro-V": "Pantene Pro-V is a line of hair care products owned by Procter & Gamble, featuring shampoos like Daily Moisture Renewal Shampoo.",
    "Aussie": "Aussie is an American toiletries brand focused on hair care products such as shampoos, conditioners, and other styling products.",
    "Pantene": "Pantene is an American hair care brand owned by Procter & Gamble, known for its range of shampoos, conditioners, and treatments designed to meet various hair needs.",
    "Escudo": "Escudo is a private limited company registered in the UK with its registered office address in London.",
    "Safeguard": "Safeguard Global offers global HR services and solutions for distributed workforces, including international recruiting, hiring, payroll, and compliance.",
    "Olay Body Collection": "Olay is an American skincare brand that was acquired by Procter & Gamble in 1985 and offers a range of body lotions designed to nourish and hydrate the skin.",
    "Vicks VapoShower": "Vicks VapoShower tablets are specially formulated to soothe with non-medicated vapors and transform an everyday shower into a relaxing experience.",
    "Olay Cleansing & Renewing": "Olay Cleansing & Renewing is a body wash product line that includes night-time formulations infused with retinol and vitamin B3 complex to hydrate, nourish, and renew skin.",
    "Olay Indulgent Moisture": "Olay Indulgent Moisture is a moisturizing body wash line from P&G Beauty that offers rich, indulgent experiences with notes of rose and cherry, mango butter, and vanilla orchid, and is infused with Vitamin B3.",
    "Olay Ultra Moisture": "Olay Ultra Moisture is a moisturizing body wash with ingredients like avocado oil and shea butter that provides long-lasting moisture for soft skin.",
    "Pampers": "Pampers is an American brand for babies and toddlers products marketed by Procter & Gamble, offering diapers, wipes, and parenting information.",
    "Pampers Sensitive": "Pampers Sensitive is a brand of baby wipes by Procter & Gamble designed for sensitive skin.",
    "Oral-B": "Oral-B is an American brand of oral hygiene products owned by Procter & Gamble, known for electric toothbrushes and dental care solutions.",
    "Crest": "Crest offers a variety of toothpaste, mouthwash, and oral hygiene products, as well as provides cyber security services and accreditations through CREST.",
    "Crest 3D White": "Crest 3D White is a tooth whitening product line made by Procter & Gamble.",
    "Crest Pro-Health": "Crest Pro-Health is a line of toothpaste products by Procter & Gamble designed for protection against cavities, gingivitis, and other oral health issues.",
    "Fixodent": "Fixodent produces denture adhesives and is registered with the FDA as a cleanser for dentures.",
    "Oral-B Cross Action": "Oral-B Cross Action is an electric toothbrush brand owned by Procter & Gamble since 2006.",
    "Crest Gum Detoxify": "Crest Gum Detoxify is a line of toothpaste owned by Procter & Gamble designed to clean deep around the gum line and neutralize harmful bacteria.",
    "Oral-B Encias Detox": "Oral-B Encías Detox is a dental product that helps reduce toxins from bacteria causing plaque and provides healthier gums from the first use.",
    "Crest Cavity Protection": "Crest Cavity Protection Toothpaste offers fluoride-based cavity protection for teeth and exposed roots, helping guard weak spots with regular brushing.",
    "Old Spice Gentlemans Blend": "Old Spice offers GentleMan's Blend deodorants and body washes designed to be gentle on skin with scents like Lavender & Mint and Brown Sugar & Cocoa Butter.",
    "Secret Whole Body": "Secret Whole Body Deodorant is a line of aluminum-free deodorants designed for use on multiple body areas including underarms, thighs, and private areas, offering long-lasting odor protection.",
    "Gillette Specialized": "Gillette Specialized produces specialized antitranspirant gels and deodorants for men.",
    "Native Candy Shop": "Native Candy Shop is a wholly Native-owned business that offers candy-inspired scented products like deodorants, body washes, lotions, and hair care items, as well as seafood products.",
    "Native Whole Body": "Native Whole Body offers deodorants and body care products made from naturally derived ingredients with clinically proven 72-hour odor protection, suitable for the whole body.",
    "Old Spice Ocean Legend": "Old Spice Ocean Legend is a deodorant product line by Old Spice, owned by Procter & Gamble and sold worldwide.",
    "Secret Aluminum Free": "Secret Aluminum Free Deodorant provides up to 48 hours of odor protection and is free of aluminum, parabens, dyes, and talc.",
    "Secret Clinical Strength": "Secret Clinical Strength is a women's antiperspirant and deodorant brand owned by Procter & Gamble, providing protection against stress sweat, heat sweat, and activity sweat.",
    "Secret Fresh Defense": "Secret Fresh Defense is a brand of antiperspirant and deodorant products for women, known for their invisible solid formula and long-lasting protection.",
    "Secret Outlast": "Secret Outlast is a deodorant brand owned by Procter & Gamble and introduced in 1956.",
    "Secret Sheer": "Not sure",
    "Old Spice Fiji": "Old Spice Fiji produces a range of anti-perspirant and deodorant products for men, including liquid and stick forms with the scent of an island vacation.",
    "Always Discreet": "Always Discreet is a line of adult incontinence products and protection from Procter & Gamble, offering underwear, pads, pantyliners, and other discreet solutions for managing bladder leaks.",
    "Pampers Baby-Dry": "Pampers Baby-Dry offers 12 hours of protection for leak-free days and nights by keeping babies' skin dry and providing multiple layers of absorbency.",
    "Pampers Club": "Pampers Club is an app that allows users to earn rewards and points for every diaper pack purchase, which can be redeemed as coupons, offers, and free baby care products.",
    "Pampers Cruisers 360": "Pampers Cruisers 360 is a line of diapers owned by Procter & Gamble featuring a stretch waistband and no-tape design.",
    "Pampers Easy Ups": "Pampers Easy Ups is a line of training pants designed for toddlers transitioning from diapers to underwear, featuring three absorbent layers and stretchy waistbands.",
    "Pampers Free & Gentle": "Pampers Free & Gentle wipes are 100% plant-based, plastic-free, hypoallergenic, and designed for gentle cleaning.",
    "Pampers Splashers": "Pampers Splashers are disposable swim pants designed for water fun at pools, beaches, and splash parks, featuring a No-Swell Core that doesn't swell in water and a gap-free fit.",
    "Pampers Swaddlers": "Pampers Swaddlers offers disposable baby diapers designed for newborns and older babies, providing protection against leaks and diaper rash.",
    "Always Corporate": "Always is a sister company of Procter & Gamble, known for its feminine hygiene products and other personal care items.",
    "Always": "Always is a brand of feminine products and menstrual information owned by Procter & Gamble.",
    "Always Maxi": "Always is an American brand of menstrual hygiene products owned by Procter & Gamble, offering a wide range of maxi pads including extra heavy and overnight options with wings for maximum protection.",
    "Tampax": "Tampax is a brand of tampons and feminine care products owned by Procter & Gamble.",
    "Always Extra Heavy Overnight": "Not sure",
    "Always Flexi-Style": "Always Dailies Flexistyle pantyliners offer flexible and thin protection for all styles of underwear, providing comfort and discretion.",
    "Always Fresh": "Always Fresh is a grower, packer, shipper, and marketer of fresh produce that provides high-quality fruits and vegetables year-round from around the world.",
    "Always Infinity": "Always Infinity is a brand of feminine hygiene products made by Procter & Gamble Inc., known for their FlexFoam technology and extra absorbency.",
    "Always Overnight": "Always Overnight provides absorbent overnight pads for women.",
    "Always Pure": "Always Pure Organics Ltd is a subsidiary of ST Brands and was acquired from New You Inc. in June 2021.",
    "Always Radiant": "Always Radiant is a brand of feminine hygiene products owned by Procter & Gamble, known for its leak-free and high-absorbency pads with features like FlexFoam and wings.",
    "Always Ultra": "Always Ultra is a brand of feminine hygiene products, including ultra thin sanitary pads with wings and overnight pads, owned by Procter & Gamble.",
    "Naturella Nocturna": "Naturella Nocturna is a brand offering sanitary pads and other feminine hygiene products.",
    "Tampax Pearl": "Tampax Pearl is a line of tampons offered by Procter & Gamble, known for all-day comfort, leak protection, and various absorbencies including Regular and Super.",
    "Tampax Radiant": "Tampax is a tampon and feminine care brand that has evolved through innovation and partnerships, such as with Always to create Radiant products.",
    "This Is L": "This Is L is a privately held, California based social enterprise and public-benefit corporation that makes organic personal care products.",
    "Whisper": "Whisper is a general-purpose speech recognition model trained by OpenAI on diverse audio data and is also capable of multitasking.",
    "Whisper Ultra": "Whisper Ultra is a brand of sanitary napkins under Procter &Gamble, designed for women with heavy flow.",
    "Oral-B Floss Action": "Oral-B Floss Action toothbrush replacement heads provide a floss-like clean with MicroPulse bristles that help loosen plaque between teeth and are compatible with Oral-B Pro 2000 or higher models.",
    "Oral-B Genius": "Oral-B is a company that produces electric toothbrushes with advanced features such as multiple cleaning modes and AI-powered feedback.",
    "Oral-B IO": "Oral-B iO is a series of electric toothbrushes featuring Magnetic technology and AI personalization for a professional clean feeling.",
    "Bevel": "Bevel is a company that offers grooming products and solutions, including trimmers for men's grooming, and has expanded into skincare, body care, and hair care products.",
    "Gillette Intimate": "Gillette Intimate is a men's grooming line by Gillette that offers products for intimate area shaving and care, including razors, trimmers, and shave creams.",
    "King C Gillette": "King C. Gillette is a company that offers a full line of beard care products including trimmers and safety razors, originally founded by King Camp Gillette in 1901 and now part of The Gillette Company.",
    "Braun Silk-Epil": "Braun Silk-Epil is a line of epilators and grooming products owned by Procter & Gamble, including epilators for legs, bikini areas, and maintenance services.",
    "Art Of Shaving": "The Art of Shaving is a men's grooming brand founded by husband-and-wife co-owners Myriam Zaoui and Eric Malka in 1996.",
    "Braun Shaving & Hair Removal Products": "Braun produces electric razors, hair removal appliances, and grooming devices under Procter & Gamble, one of the largest consumer-product groups in the world.",
    "Gillette Labs": "GilletteLabs offers innovative shaving products with advanced technology such as FlexDisc and exfoliating bars for a smooth grooming experience.",
    "Gillette SkinGuard": "Gillette SkinGuard is a razor designed for men with sensitive skin and issues like acne, pimples, and razor bumps, featuring technologies that minimize skin contact and irritation.",
    "Braun All-In-One": "Braun is a company known for producing electric razors, grooming tools, epilators, and other personal care products, now part of Procter & Gamble's portfolio.",
    "Braun Series 9": "Braun GmbH is a German consumer products company founded in 1921 and based in Kronberg im Taunus.",
    "Gillette Fusion": "Gillette Fusion offers manual razors and blades with advanced 5-blade technology designed for a comfortable and close shave.",
    "Gillette Mach 3": "Gillette MACH3 is a line of premium razors for men produced by Gillette, featuring multiple blades and ergonomic design for a closer and more comfortable shave.",
    "Gillette ProGlide": "Gillette ProGlide is a line of manual shaving razors designed for smooth and irritation-free shaving experiences with features like Flexball technology and enhanced lubricant strips.",
    "Old Spice Raptorstrike": "Old Spice Raptorstrike is a line of deodorants and body washes for men offered by Shulton, Inc., known for their aluminum-free, long-lasting scent and triple protection power.",
    "Zirh Store": "Zirh is a premium grooming brand founded in 1995 that offers high-quality skincare and shaving products, later acquired by P&G in 2009.",
    "Procter & Gamble Professional Line": "P&G Professional is the away-from-home division of Procter & Gamble that provides cleaning innovations, solutions, and supplies to help businesses shine with a portfolio of trusted brands."
}